/*
Navicat MySQL Data Transfer

Source Server         : 101.34.137.166
Source Server Version : 80013
Source Host           : 101.34.137.166:3306
Source Database       : vhr

Target Server Type    : MYSQL
Target Server Version : 80013
File Encoding         : 65001

Date: 2025-05-13 21:25:54
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for adjustsalary
-- ----------------------------
DROP TABLE IF EXISTS `adjustsalary`;
CREATE TABLE `adjustsalary` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `eid` int(11) DEFAULT NULL,
  `asDate` date DEFAULT NULL COMMENT '调薪日期',
  `beforeSalary` int(11) DEFAULT NULL COMMENT '调前薪资',
  `afterSalary` int(11) DEFAULT NULL COMMENT '调后薪资',
  `reason` varchar(255) DEFAULT NULL COMMENT '调薪原因',
  `remark` varchar(255) DEFAULT NULL COMMENT '备注',
  PRIMARY KEY (`id`),
  KEY `pid` (`eid`),
  CONSTRAINT `adjustsalary_ibfk_1` FOREIGN KEY (`eid`) REFERENCES `employee` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of adjustsalary
-- ----------------------------
INSERT INTO `adjustsalary` VALUES ('2', '1', '2025-03-19', '20000', '20001', '1', '11');
INSERT INTO `adjustsalary` VALUES ('3', '2', '2025-03-19', '9000', '9', '1', '1');
INSERT INTO `adjustsalary` VALUES ('4', '3', '2025-05-12', '20000', '10000', '工作态度不端正', '');

-- ----------------------------
-- Table structure for appraise
-- ----------------------------
DROP TABLE IF EXISTS `appraise`;
CREATE TABLE `appraise` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `eid` int(11) DEFAULT NULL,
  `appDate` date DEFAULT NULL COMMENT '考评日期',
  `appResult` varchar(32) DEFAULT NULL COMMENT '考评结果',
  `appContent` varchar(255) DEFAULT NULL COMMENT '考评内容',
  `remark` varchar(255) DEFAULT NULL COMMENT '备注',
  PRIMARY KEY (`id`),
  KEY `pid` (`eid`),
  CONSTRAINT `appraise_ibfk_1` FOREIGN KEY (`eid`) REFERENCES `employee` (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of appraise
-- ----------------------------

-- ----------------------------
-- Table structure for department
-- ----------------------------
DROP TABLE IF EXISTS `department`;
CREATE TABLE `department` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(32) DEFAULT NULL COMMENT '部门名称',
  `parentId` int(11) DEFAULT NULL,
  `depPath` varchar(255) DEFAULT NULL,
  `enabled` tinyint(1) DEFAULT '1',
  `isParent` tinyint(1) DEFAULT '0',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=106 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of department
-- ----------------------------
INSERT INTO `department` VALUES ('1', '股东会', '-1', '.1', '1', '1');
INSERT INTO `department` VALUES ('4', '董事会', '1', '.1.4', '1', '1');
INSERT INTO `department` VALUES ('5', '总办', '4', '.1.4.5', '1', '1');
INSERT INTO `department` VALUES ('8', '财务部', '5', '.1.4.5.8', '1', '0');
INSERT INTO `department` VALUES ('78', '市场部', '5', '.1.4.5.78', '1', '1');
INSERT INTO `department` VALUES ('81', '华北市场部', '78', '.1.4.5.78.81', '1', '1');
INSERT INTO `department` VALUES ('82', '华南市场部', '78', '.1.4.5.78.82', '1', '0');
INSERT INTO `department` VALUES ('85', '北京市场部', '81', '.1.4.5.78.81.85', '1', '0');
INSERT INTO `department` VALUES ('86', '西北市场部', '78', '.1.4.5.78.86', '1', '1');
INSERT INTO `department` VALUES ('87', '西安市场', '86', '.1.4.5.78.86.87', '1', '1');
INSERT INTO `department` VALUES ('89', '莲湖区市场', '87', '.1.4.5.78.86.87.89', '1', '0');
INSERT INTO `department` VALUES ('91', '技术部', '5', '.1.4.5.91', '1', '0');
INSERT INTO `department` VALUES ('92', '运维部', '5', '.1.4.5.92', '1', '1');
INSERT INTO `department` VALUES ('93', '运维1部', '92', '.1.4.5.92.93', '1', '0');
INSERT INTO `department` VALUES ('94', '运维2部', '92', '.1.4.5.92.94', '1', '0');
INSERT INTO `department` VALUES ('96', 'bbb', '1', '.1.96', '1', '1');
INSERT INTO `department` VALUES ('104', '111', '96', '.1.96.104', '1', '0');
INSERT INTO `department` VALUES ('105', '222', '96', '.1.96.105', '1', '0');

-- ----------------------------
-- Table structure for employee
-- ----------------------------
DROP TABLE IF EXISTS `employee`;
CREATE TABLE `employee` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '员工编号',
  `name` varchar(10) DEFAULT NULL COMMENT '员工姓名',
  `gender` char(4) DEFAULT NULL COMMENT '性别',
  `birthday` date DEFAULT NULL COMMENT '出生日期',
  `idCard` char(18) DEFAULT NULL COMMENT '身份证号',
  `wedlock` enum('已婚','未婚','离异') DEFAULT NULL COMMENT '婚姻状况',
  `nationId` int(11) DEFAULT NULL COMMENT '民族',
  `nativePlace` varchar(20) DEFAULT NULL COMMENT '籍贯',
  `politicId` int(11) DEFAULT NULL COMMENT '政治面貌',
  `email` varchar(20) DEFAULT NULL COMMENT '邮箱',
  `phone` varchar(11) DEFAULT NULL COMMENT '电话号码',
  `address` varchar(64) DEFAULT NULL COMMENT '联系地址',
  `departmentId` int(11) DEFAULT NULL COMMENT '所属部门',
  `jobLevelId` int(11) DEFAULT NULL COMMENT '职称ID',
  `posId` int(11) DEFAULT NULL COMMENT '职位ID',
  `engageForm` varchar(8) DEFAULT NULL COMMENT '聘用形式',
  `tiptopDegree` enum('博士','硕士','本科','大专','高中','初中','小学','其他') DEFAULT NULL COMMENT '最高学历',
  `specialty` varchar(32) DEFAULT NULL COMMENT '所属专业',
  `school` varchar(32) DEFAULT NULL COMMENT '毕业院校',
  `beginDate` date DEFAULT NULL COMMENT '入职日期',
  `workState` enum('在职','离职') DEFAULT '在职' COMMENT '在职状态',
  `workID` char(8) DEFAULT NULL COMMENT '工号',
  `contractTerm` double DEFAULT NULL COMMENT '合同期限',
  `conversionTime` date DEFAULT NULL COMMENT '转正日期',
  `notWorkDate` date DEFAULT NULL COMMENT '离职日期',
  `beginContract` date DEFAULT NULL COMMENT '合同起始日期',
  `endContract` date DEFAULT NULL COMMENT '合同终止日期',
  `workAge` int(11) DEFAULT NULL COMMENT '工龄',
  PRIMARY KEY (`id`),
  KEY `departmentId` (`departmentId`),
  KEY `jobId` (`jobLevelId`),
  KEY `dutyId` (`posId`),
  KEY `nationId` (`nationId`),
  KEY `politicId` (`politicId`),
  KEY `workID_key` (`workID`),
  CONSTRAINT `employee_ibfk_1` FOREIGN KEY (`departmentId`) REFERENCES `department` (`id`),
  CONSTRAINT `employee_ibfk_2` FOREIGN KEY (`jobLevelId`) REFERENCES `joblevel` (`id`),
  CONSTRAINT `employee_ibfk_3` FOREIGN KEY (`posId`) REFERENCES `position` (`id`),
  CONSTRAINT `employee_ibfk_4` FOREIGN KEY (`nationId`) REFERENCES `nation` (`id`),
  CONSTRAINT `employee_ibfk_5` FOREIGN KEY (`politicId`) REFERENCES `politicsstatus` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2567 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of employee
-- ----------------------------
INSERT INTO `employee` VALUES ('1', '江南一点雨', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000001', '2', '2018-04-01', null, '2018-01-01', '2020-01-01', null);
INSERT INTO `employee` VALUES ('2', '陈静', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '91', '12', '29', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000002', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('3', '赵琳浩', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000003', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('4', '鹿存亮', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000004', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('5', '姚森', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '硕士', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000005', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('6', '云星', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000006', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('7', '贾旭明', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000007', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('8', '张黎明', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000008', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('9', '薛磊', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000009', '6', '2018-04-01', null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('10', '张洁', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000010', '1', '2018-01-31', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('11', '江南一点雨2', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '91', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000011', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('12', '陈静2', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000012', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('13', '赵琳浩2', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000013', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('14', '鹿存亮2', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000014', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('15', '姚森2', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000015', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('16', '云星2', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000016', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('17', '贾旭明2', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000017', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('18', '王一亭', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000018', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('19', '薛磊2', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000019', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('20', '张洁2', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000020', '1', '2018-01-31', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('21', '江南一点雨3', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000021', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('22', '陈静3', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000022', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('24', '鹿存亮3', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000024', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('25', '姚森3', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000025', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('26', '云星3', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000026', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('27', '贾旭明3', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000027', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('28', '张黎明3', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000028', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('29', '薛磊3', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000029', '6', '2018-04-01', null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('31', '江南一点雨4', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000031', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('32', '陈静4', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000032', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('33', '赵琳浩4', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000033', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('34', '鹿存亮4', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000034', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('35', '姚森4', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000035', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('36', '云星4', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000036', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('37', '贾旭明4', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000037', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('38', '张黎明2', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000038', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('39', '薛磊4', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000039', '6', '2018-04-01', null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('40', '张洁4', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000040', '1', '2018-01-31', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('41', '江南一点雨5', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000041', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('42', '陈静5', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000042', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('43', '赵琳浩5', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000043', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('44', '鹿存亮5', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000044', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('45', '姚森5', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000045', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('46', '云星5', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000046', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('47', '贾旭明5', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000047', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('48', '张黎明5', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000048', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('49', '薛磊5', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000049', '6', '2018-04-01', null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('50', '张洁5', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000050', '1', '2018-01-31', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('51', '江南一点雨6', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000051', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('52', '陈静6', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000052', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('53', '赵琳浩6', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000053', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('54', '鹿存亮6', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000054', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('55', '姚森6', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000055', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('56', '云星6', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000056', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1351', '江南一点雨', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000001', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1352', '陈静', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000002', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1353', '赵琳浩', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000003', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1354', '鹿存亮', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000004', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1355', '姚森', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000005', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1357', '贾旭明', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000007', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1358', '张黎明', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000008', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1359', '薛磊', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000009', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1360', '张洁', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000010', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1361', '江南一点雨2', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000011', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1362', '陈静2', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000012', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1363', '赵琳浩2', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000013', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1364', '鹿存亮2', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000014', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1365', '姚森2', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000015', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1366', '云星2', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000016', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1367', '贾旭明2', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000017', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1368', '王一亭', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000018', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1369', '薛磊2', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000019', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1370', '张洁2', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000020', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1371', '江南一点雨3', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000021', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1372', '陈静3', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000022', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1373', '鹿存亮3', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000024', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1374', '姚森3', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000025', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1375', '云星3', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000026', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1376', '贾旭明3', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000027', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1377', '张黎明3', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000028', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1378', '薛磊3', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000029', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1379', '江南一点雨4', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000031', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1380', '陈静4', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000032', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1381', '赵琳浩4', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000033', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1382', '鹿存亮4', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000034', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1383', '姚森4', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000035', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1384', '云星4', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000036', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1385', '贾旭明4', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000037', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1411', '谢工', '女', '1970-01-01', '618177197001011234', '离异', '1', '江苏', '1', '584991843@qq.com', '18558887788', '北京', '91', '12', '29', '劳动合同', '本科', '计算机软件', '南华大学', '2018-01-01', '在职', '00000038', '5', '2019-01-01', null, '2018-01-01', '2023-01-01', null);
INSERT INTO `employee` VALUES ('1412', '林昭亮', '男', '1990-01-01', '610122199809091234', '已婚', '1', '广东', '13', '584991843@qq.com', '16767776654', '广东深圳', '91', '15', '33', '劳动合同', '大专', '计算机软件', '广东职业技术学院', '2018-01-01', '在职', '00000039', '5', '2018-04-01', null, '2018-01-01', '2023-01-01', null);
INSERT INTO `employee` VALUES ('1413', '11', '男', '2018-01-01', '610122201801011234', '已婚', '1', '1', '1', '584991843@qq.com', '111', '1', '89', '9', '29', '劳动合同', '本科', '1', '1', '2018-01-01', '在职', '00000040', '4', '2018-04-01', null, '2018-01-01', '2022-01-26', null);
INSERT INTO `employee` VALUES ('1414', '1', '男', '2018-01-01', '610188199809091234', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '89', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000041', '1', '2018-01-31', null, '2018-01-31', '2019-01-31', null);
INSERT INTO `employee` VALUES ('1415', '1', '男', '2018-01-01', '610122199909090000', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '78', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000042', '1', '2018-01-31', null, '2018-01-31', '2019-01-31', null);
INSERT INTO `employee` VALUES ('1416', '1', '男', '2018-01-01', '610122199909090000', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '81', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000043', '0', '2018-01-31', null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1417', '1', '男', '2018-01-01', '610122199909099999', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '87', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-01', '在职', '00000044', '0', '2018-01-01', null, '2018-01-01', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1418', '1', '男', '2018-01-01', '610122199909099999', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '78', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-01', '在职', '00000045', '0', '2018-01-01', null, '2018-01-01', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1419', '林伯渠', '男', '2018-01-01', '610122199909099999', '未婚', '1', '1', '1', '584991843@qq.com', '1', '1', '8', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000046', '0', '2018-01-31', null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1420', '1', '男', '2018-01-01', '610122199909091234', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '8', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000047', '0', '2018-01-31', null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1421', '江南一点雨', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000001', '2', null, null, '2018-01-01', '2020-01-01', null);
INSERT INTO `employee` VALUES ('1422', '陈静', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '8', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000002', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1423', '赵琳浩', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000003', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1424', '鹿存亮', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000004', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1425', '姚森', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '硕士', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000005', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1426', '云星', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000006', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1427', '贾旭明', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000007', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1428', '张黎明', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000008', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1429', '薛磊', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000009', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1430', '张洁', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000010', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1431', '江南一点雨2', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '91', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000011', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1432', '陈静2', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000012', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1433', '赵琳浩2', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000013', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1434', '鹿存亮2', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000014', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1435', '姚森2', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000015', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1436', '云星2', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000016', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1437', '贾旭明2', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000017', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1438', '王一亭', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000018', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1439', '薛磊2', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000019', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1440', '张洁2', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000020', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1441', '江南一点雨3', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000021', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1442', '陈静3', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000022', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1443', '鹿存亮3', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000024', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1444', '姚森3', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000025', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1445', '云星3', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000026', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1446', '贾旭明3', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000027', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1447', '张黎明3', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000028', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1448', '薛磊3', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000029', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1449', '江南一点雨4', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000031', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1450', '陈静4', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000032', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1451', '赵琳浩4', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000033', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1452', '鹿存亮4', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000034', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1453', '姚森4', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000035', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1454', '云星4', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000036', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1455', '贾旭明4', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000037', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1456', '张黎明2', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000038', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1457', '薛磊4', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000039', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1458', '张洁4', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000040', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1459', '江南一点雨5', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000041', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1460', '陈静5', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000042', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1461', '赵琳浩5', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000043', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1462', '鹿存亮5', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000044', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1463', '姚森5', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000045', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1464', '云星5', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000046', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1465', '贾旭明5', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000047', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1466', '张黎明5', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000048', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1467', '薛磊5', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000049', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1468', '张洁5', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000050', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1469', '江南一点雨6', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000051', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1470', '陈静6', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000052', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1471', '赵琳浩6', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000053', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1472', '鹿存亮6', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000054', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1473', '姚森6', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000055', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1474', '云星6', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000056', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1475', '江南一点雨', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000001', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1476', '陈静', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000002', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1477', '赵琳浩', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000003', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1478', '鹿存亮', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000004', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1479', '姚森', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000005', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1480', '贾旭明', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000007', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1481', '张黎明', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000008', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1482', '薛磊', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000009', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1483', '张洁', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000010', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1484', '江南一点雨2', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000011', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1485', '陈静2', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000012', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1486', '赵琳浩2', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000013', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1487', '鹿存亮2', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000014', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1488', '姚森2', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000015', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1489', '云星2', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000016', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1490', '贾旭明2', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000017', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1491', '王一亭', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000018', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1492', '薛磊2', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000019', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1493', '张洁2', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000020', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1494', '江南一点雨3', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000021', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1495', '陈静3', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000022', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1496', '鹿存亮3', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000024', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1497', '姚森3', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000025', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1498', '云星3', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000026', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1499', '贾旭明3', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000027', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1500', '张黎明3', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000028', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1501', '薛磊3', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000029', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1502', '江南一点雨4', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000031', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1503', '陈静4', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000032', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1504', '赵琳浩4', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000033', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1505', '鹿存亮4', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000034', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1506', '姚森4', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000035', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1507', '云星4', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000036', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1508', '贾旭明4', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000037', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1509', '谢工', '女', '1970-01-01', '618177197001011234', '离异', '1', '江苏', '1', '584991843@qq.com', '18558887788', '北京', '91', '12', '29', '劳动合同', '本科', '计算机软件', '南华大学', '2018-01-01', '在职', '00000038', '5', null, null, '2018-01-01', '2023-01-01', null);
INSERT INTO `employee` VALUES ('1510', '林昭亮', '男', '1990-01-01', '610122199809091234', '已婚', '1', '广东', '13', '584991843@qq.com', '16767776654', '广东深圳', '91', '15', '33', '劳动合同', '大专', '计算机软件', '广东职业技术学院', '2018-01-01', '在职', '00000039', '5', null, null, '2018-01-01', '2023-01-01', null);
INSERT INTO `employee` VALUES ('1511', '11', '男', '2018-01-01', '610122201801011234', '已婚', '1', '1', '1', '584991843@qq.com', '111', '1', '89', '9', '29', '劳动合同', '本科', '1', '1', '2018-01-01', '在职', '00000040', '4', null, null, '2018-01-01', '2022-01-26', null);
INSERT INTO `employee` VALUES ('1512', '1', '男', '2018-01-01', '610188199809091234', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '89', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000041', '1', null, null, '2018-01-31', '2019-01-31', null);
INSERT INTO `employee` VALUES ('1513', '1', '男', '2018-01-01', '610122199909090000', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '78', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000042', '1', null, null, '2018-01-31', '2019-01-31', null);
INSERT INTO `employee` VALUES ('1514', '1', '男', '2018-01-01', '610122199909090000', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '81', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000043', '0', null, null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1515', '1', '男', '2018-01-01', '610122199909099999', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '87', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-01', '在职', '00000044', '0', null, null, '2018-01-01', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1516', '1', '男', '2018-01-01', '610122199909099999', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '78', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-01', '在职', '00000045', '0', null, null, '2018-01-01', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1517', '林伯渠', '男', '2018-01-01', '610122199909099999', '未婚', '1', '1', '1', '584991843@qq.com', '1', '1', '8', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000046', '0', null, null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1518', '1', '男', '2018-01-01', '610122199909091234', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '8', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000047', '0', null, null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1519', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000057', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('1520', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '93', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2019-11-05', '在职', '00000058', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('1521', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '93', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2019-11-05', '在职', '00000059', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('1522', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowan@123.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000060', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('1523', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowan@123.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000060', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('1526', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '91', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000061', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('1527', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '91', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000062', '6.17', '2018-03-31', null, '2017-12-31', '2024-02-29', null);
INSERT INTO `employee` VALUES ('1528', 'javaboy666', '男', '2019-11-10', '610122199911111111', '已婚', '1', '广东', '13', '123@qq.com', '12345678901', '广东深圳', '78', '9', '29', '劳动合同', '本科', '信管', '深圳大学', '2019-11-10', '在职', '00000063', '3.25', '2020-02-10', null, '2019-11-10', '2023-02-22', null);
INSERT INTO `employee` VALUES ('1529', 'javaboy666', '男', '2019-11-10', '610122199911111111', '已婚', '1', '广东', '13', '123@qq.com', '12345678901', '广东深圳', '78', '9', '29', '劳动合同', '本科', '信管', '深圳大学', '2019-11-10', '在职', '00000063', '3.25', '2020-02-10', null, '2019-11-10', '2023-02-22', null);
INSERT INTO `employee` VALUES ('1530', '江南一点雨', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000001', '2', '2018-04-01', null, '2018-01-01', '2020-01-01', null);
INSERT INTO `employee` VALUES ('1531', '陈静', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '91', '12', '29', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000002', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1532', '赵琳浩', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000003', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1533', '鹿存亮', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000004', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1534', '姚森', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '硕士', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000005', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1535', '云星', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000006', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1536', '贾旭明', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000007', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1537', '张黎明', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000008', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1538', '薛磊', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000009', '6', '2018-04-01', null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1539', '张洁', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000010', '1', '2018-01-31', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1540', '江南一点雨2', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '91', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000011', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1541', '陈静2', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000012', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1542', '赵琳浩2', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000013', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1543', '鹿存亮2', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000014', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1544', '姚森2', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000015', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1545', '云星2', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000016', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1546', '贾旭明2', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000017', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1547', '王一亭', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000018', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1548', '薛磊2', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000019', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1549', '张洁2', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000020', '1', '2018-01-31', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1550', '江南一点雨3', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000021', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1551', '陈静3', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000022', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1552', '鹿存亮3', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000024', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1553', '姚森3', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000025', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1554', '云星3', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000026', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1555', '贾旭明3', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000027', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1556', '张黎明3', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000028', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1557', '薛磊3', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000029', '6', '2018-04-01', null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1558', '江南一点雨4', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000031', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1559', '陈静4', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000032', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1560', '赵琳浩4', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000033', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1561', '鹿存亮4', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000034', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1562', '姚森4', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000035', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1563', '云星4', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000036', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1564', '贾旭明4', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000037', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1565', '张黎明2', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000038', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1566', '薛磊4', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000039', '6', '2018-04-01', null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1567', '张洁4', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000040', '1', '2018-01-31', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1568', '江南一点雨5', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000041', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1569', '陈静5', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000042', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1570', '赵琳浩5', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000043', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1571', '鹿存亮5', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000044', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1572', '姚森5', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000045', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1573', '云星5', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000046', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1574', '贾旭明5', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000047', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1575', '张黎明5', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000048', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1576', '薛磊5', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000049', '6', '2018-04-01', null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1577', '张洁5', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000050', '1', '2018-01-31', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1578', '江南一点雨6', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000051', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1579', '陈静6', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000052', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1580', '赵琳浩6', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000053', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1581', '鹿存亮6', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000054', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1582', '姚森6', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000055', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1583', '云星6', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000056', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1584', '江南一点雨', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000001', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1585', '陈静', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000002', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1586', '赵琳浩', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000003', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1587', '鹿存亮', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000004', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1588', '姚森', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000005', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1589', '贾旭明', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000007', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1590', '张黎明', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000008', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1591', '薛磊', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000009', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1592', '张洁', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000010', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1593', '江南一点雨2', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000011', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1594', '陈静2', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000012', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1595', '赵琳浩2', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000013', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1596', '鹿存亮2', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000014', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1597', '姚森2', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000015', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1598', '云星2', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000016', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1599', '贾旭明2', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000017', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1600', '王一亭', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000018', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1601', '薛磊2', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000019', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1602', '张洁2', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000020', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1603', '江南一点雨3', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000021', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1604', '陈静3', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000022', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1605', '鹿存亮3', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000024', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1606', '姚森3', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000025', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1607', '云星3', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000026', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1608', '贾旭明3', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000027', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1609', '张黎明3', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000028', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1610', '薛磊3', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000029', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1611', '江南一点雨4', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000031', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1612', '陈静4', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000032', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1613', '赵琳浩4', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000033', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1614', '鹿存亮4', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000034', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1615', '姚森4', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000035', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1616', '云星4', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000036', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1617', '贾旭明4', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000037', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1618', '谢工', '女', '1970-01-01', '618177197001011234', '离异', '1', '江苏', '1', '584991843@qq.com', '18558887788', '北京', '91', '12', '29', '劳动合同', '本科', '计算机软件', '南华大学', '2018-01-01', '在职', '00000038', '5', '2019-01-01', null, '2018-01-01', '2023-01-01', null);
INSERT INTO `employee` VALUES ('1619', '林昭亮', '男', '1990-01-01', '610122199809091234', '已婚', '1', '广东', '13', '584991843@qq.com', '16767776654', '广东深圳', '91', '15', '33', '劳动合同', '大专', '计算机软件', '广东职业技术学院', '2018-01-01', '在职', '00000039', '5', '2018-04-01', null, '2018-01-01', '2023-01-01', null);
INSERT INTO `employee` VALUES ('1620', '11', '男', '2018-01-01', '610122201801011234', '已婚', '1', '1', '1', '584991843@qq.com', '111', '1', '89', '9', '29', '劳动合同', '本科', '1', '1', '2018-01-01', '在职', '00000040', '4', '2018-04-01', null, '2018-01-01', '2022-01-26', null);
INSERT INTO `employee` VALUES ('1621', '1', '男', '2018-01-01', '610188199809091234', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '89', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000041', '1', '2018-01-31', null, '2018-01-31', '2019-01-31', null);
INSERT INTO `employee` VALUES ('1622', '1', '男', '2018-01-01', '610122199909090000', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '78', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000042', '1', '2018-01-31', null, '2018-01-31', '2019-01-31', null);
INSERT INTO `employee` VALUES ('1623', '1', '男', '2018-01-01', '610122199909090000', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '81', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000043', '0', '2018-01-31', null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1624', '1', '男', '2018-01-01', '610122199909099999', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '87', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-01', '在职', '00000044', '0', '2018-01-01', null, '2018-01-01', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1625', '1', '男', '2018-01-01', '610122199909099999', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '78', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-01', '在职', '00000045', '0', '2018-01-01', null, '2018-01-01', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1626', '林伯渠', '男', '2018-01-01', '610122199909099999', '未婚', '1', '1', '1', '584991843@qq.com', '1', '1', '8', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000046', '0', '2018-01-31', null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1627', '1', '男', '2018-01-01', '610122199909091234', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '8', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000047', '0', '2018-01-31', null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1628', '江南一点雨', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000001', '2', null, null, '2018-01-01', '2020-01-01', null);
INSERT INTO `employee` VALUES ('1629', '陈静', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '8', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000002', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1630', '赵琳浩', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000003', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1631', '鹿存亮', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000004', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1632', '姚森', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '硕士', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000005', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1633', '云星', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000006', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1634', '贾旭明', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000007', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1635', '张黎明', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000008', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1636', '薛磊', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000009', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1637', '张洁', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000010', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1638', '江南一点雨2', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '91', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000011', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1639', '陈静2', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000012', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1640', '赵琳浩2', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000013', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1641', '鹿存亮2', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000014', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1642', '姚森2', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000015', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1643', '云星2', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000016', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1644', '贾旭明2', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000017', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1645', '王一亭', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000018', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1646', '薛磊2', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000019', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1647', '张洁2', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000020', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1648', '江南一点雨3', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000021', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1649', '陈静3', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000022', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1650', '鹿存亮3', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000024', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1651', '姚森3', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000025', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1652', '云星3', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000026', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1653', '贾旭明3', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000027', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1654', '张黎明3', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000028', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1655', '薛磊3', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000029', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1656', '江南一点雨4', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000031', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1657', '陈静4', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000032', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1658', '赵琳浩4', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000033', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1659', '鹿存亮4', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000034', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1660', '姚森4', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000035', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1661', '云星4', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000036', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1662', '贾旭明4', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000037', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1663', '张黎明2', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000038', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1664', '薛磊4', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000039', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1665', '张洁4', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000040', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1666', '江南一点雨5', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000041', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1667', '陈静5', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000042', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1668', '赵琳浩5', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000043', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1669', '鹿存亮5', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000044', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1670', '姚森5', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000045', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1671', '云星5', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000046', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1672', '贾旭明5', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000047', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1673', '张黎明5', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000048', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1674', '薛磊5', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000049', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1675', '张洁5', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000050', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1676', '江南一点雨6', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000051', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1677', '陈静6', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000052', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1678', '赵琳浩6', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000053', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1679', '鹿存亮6', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000054', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1680', '姚森6', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000055', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1681', '云星6', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000056', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1682', '江南一点雨', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000001', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1683', '陈静', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000002', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1684', '赵琳浩', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000003', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1685', '鹿存亮', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000004', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1686', '姚森', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000005', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1687', '贾旭明', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000007', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1688', '张黎明', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000008', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1689', '薛磊', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000009', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1690', '张洁', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000010', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1691', '江南一点雨2', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000011', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1692', '陈静2', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000012', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1693', '赵琳浩2', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000013', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1694', '鹿存亮2', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000014', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1695', '姚森2', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000015', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1696', '云星2', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000016', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1697', '贾旭明2', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000017', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1698', '王一亭', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000018', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1699', '薛磊2', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000019', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1700', '张洁2', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000020', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1701', '江南一点雨3', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000021', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1702', '陈静3', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000022', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1703', '鹿存亮3', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000024', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1704', '姚森3', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000025', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1705', '云星3', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000026', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1706', '贾旭明3', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000027', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1707', '张黎明3', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000028', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1708', '薛磊3', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000029', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1709', '江南一点雨4', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000031', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1710', '陈静4', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000032', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1711', '赵琳浩4', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000033', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1712', '鹿存亮4', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000034', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1713', '姚森4', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000035', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1714', '云星4', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000036', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1715', '贾旭明4', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000037', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1716', '谢工', '女', '1970-01-01', '618177197001011234', '离异', '1', '江苏', '1', '584991843@qq.com', '18558887788', '北京', '91', '12', '29', '劳动合同', '本科', '计算机软件', '南华大学', '2018-01-01', '在职', '00000038', '5', null, null, '2018-01-01', '2023-01-01', null);
INSERT INTO `employee` VALUES ('1717', '林昭亮', '男', '1990-01-01', '610122199809091234', '已婚', '1', '广东', '13', '584991843@qq.com', '16767776654', '广东深圳', '91', '15', '33', '劳动合同', '大专', '计算机软件', '广东职业技术学院', '2018-01-01', '在职', '00000039', '5', null, null, '2018-01-01', '2023-01-01', null);
INSERT INTO `employee` VALUES ('1718', '11', '男', '2018-01-01', '610122201801011234', '已婚', '1', '1', '1', '584991843@qq.com', '111', '1', '89', '9', '29', '劳动合同', '本科', '1', '1', '2018-01-01', '在职', '00000040', '4', null, null, '2018-01-01', '2022-01-26', null);
INSERT INTO `employee` VALUES ('1719', '1', '男', '2018-01-01', '610188199809091234', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '89', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000041', '1', null, null, '2018-01-31', '2019-01-31', null);
INSERT INTO `employee` VALUES ('1720', '1', '男', '2018-01-01', '610122199909090000', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '78', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000042', '1', null, null, '2018-01-31', '2019-01-31', null);
INSERT INTO `employee` VALUES ('1721', '1', '男', '2018-01-01', '610122199909090000', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '81', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000043', '0', null, null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1722', '1', '男', '2018-01-01', '610122199909099999', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '87', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-01', '在职', '00000044', '0', null, null, '2018-01-01', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1723', '1', '男', '2018-01-01', '610122199909099999', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '78', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-01', '在职', '00000045', '0', null, null, '2018-01-01', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1724', '林伯渠', '男', '2018-01-01', '610122199909099999', '未婚', '1', '1', '1', '584991843@qq.com', '1', '1', '8', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000046', '0', null, null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1725', '1', '男', '2018-01-01', '610122199909091234', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '8', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000047', '0', null, null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1726', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000057', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('1727', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '93', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2019-11-05', '在职', '00000058', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('1728', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '93', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2019-11-05', '在职', '00000059', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('1729', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowan@123.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000060', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('1730', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowan@123.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000060', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('1731', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '91', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000061', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('1732', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '91', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000062', '6.17', '2018-03-31', null, '2017-12-31', '2024-02-29', null);
INSERT INTO `employee` VALUES ('1733', 'javaboy666', '男', '2019-11-10', '610122199911111111', '已婚', '1', '广东', '13', '123@qq.com', '12345678901', '广东深圳', '78', '9', '29', '劳动合同', '本科', '信管', '深圳大学', '2019-11-10', '在职', '00000063', '3.25', '2020-02-10', null, '2019-11-10', '2023-02-22', null);
INSERT INTO `employee` VALUES ('1734', 'javaboy666', '男', '2019-11-10', '610122199911111111', '已婚', '1', '广东', '13', '123@qq.com', '12345678901', '广东深圳', '78', '9', '29', '劳动合同', '本科', '信管', '深圳大学', '2019-11-10', '在职', '00000063', '3.25', '2020-02-10', null, '2019-11-10', '2023-02-22', null);
INSERT INTO `employee` VALUES ('1735', '江南一点雨', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000001', '2', '2018-04-01', null, '2018-01-01', '2020-01-01', null);
INSERT INTO `employee` VALUES ('1736', '陈静', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '91', '12', '29', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000002', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1737', '赵琳浩', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000003', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1738', '鹿存亮', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000004', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1739', '姚森', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '硕士', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000005', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1740', '云星', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000006', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1741', '贾旭明', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000007', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1742', '张黎明', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000008', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1743', '薛磊', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000009', '6', '2018-04-01', null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1744', '张洁', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000010', '1', '2018-01-31', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1745', '江南一点雨2', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '91', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000011', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1746', '陈静2', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000012', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1747', '赵琳浩2', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000013', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1748', '鹿存亮2', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000014', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1749', '姚森2', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000015', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1750', '云星2', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000016', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1751', '贾旭明2', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000017', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1752', '王一亭', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000018', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1753', '薛磊2', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000019', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1754', '张洁2', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000020', '1', '2018-01-31', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1755', '江南一点雨3', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000021', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1756', '陈静3', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000022', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1757', '鹿存亮3', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000024', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1758', '姚森3', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000025', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1759', '云星3', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000026', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1760', '贾旭明3', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000027', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1761', '张黎明3', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000028', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1762', '薛磊3', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000029', '6', '2018-04-01', null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1763', '江南一点雨4', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000031', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1764', '陈静4', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000032', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1765', '赵琳浩4', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000033', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1766', '鹿存亮4', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000034', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1767', '姚森4', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000035', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1768', '云星4', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000036', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1769', '贾旭明4', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000037', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1770', '张黎明2', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000038', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1771', '薛磊4', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000039', '6', '2018-04-01', null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1772', '张洁4', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000040', '1', '2018-01-31', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1773', '江南一点雨5', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000041', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1774', '陈静5', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000042', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1775', '赵琳浩5', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000043', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1776', '鹿存亮5', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000044', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1777', '姚森5', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000045', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1778', '云星5', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000046', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1779', '贾旭明5', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000047', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1780', '张黎明5', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000048', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1781', '薛磊5', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000049', '6', '2018-04-01', null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1782', '张洁5', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000050', '1', '2018-01-31', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1783', '江南一点雨6', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000051', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1784', '陈静6', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000052', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1785', '赵琳浩6', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000053', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1786', '鹿存亮6', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000054', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1787', '姚森6', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000055', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1788', '云星6', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000056', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1789', '江南一点雨', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000001', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1790', '陈静', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000002', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1791', '赵琳浩', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000003', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1792', '鹿存亮', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000004', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1793', '姚森', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000005', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1794', '贾旭明', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000007', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1795', '张黎明', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000008', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1796', '薛磊', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000009', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1797', '张洁', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000010', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1798', '江南一点雨2', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000011', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1799', '陈静2', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000012', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1800', '赵琳浩2', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000013', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1801', '鹿存亮2', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000014', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1802', '姚森2', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000015', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1803', '云星2', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000016', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1804', '贾旭明2', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000017', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1805', '王一亭', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000018', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1806', '薛磊2', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000019', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1807', '张洁2', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000020', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1808', '江南一点雨3', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000021', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1809', '陈静3', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000022', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1810', '鹿存亮3', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000024', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1811', '姚森3', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000025', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1812', '云星3', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000026', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1813', '贾旭明3', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000027', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1814', '张黎明3', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000028', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1815', '薛磊3', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000029', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1816', '江南一点雨4', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000031', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1817', '陈静4', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000032', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1818', '赵琳浩4', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000033', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1819', '鹿存亮4', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000034', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1820', '姚森4', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000035', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1821', '云星4', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000036', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1822', '贾旭明4', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000037', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1823', '谢工', '女', '1970-01-01', '618177197001011234', '离异', '1', '江苏', '1', '584991843@qq.com', '18558887788', '北京', '91', '12', '29', '劳动合同', '本科', '计算机软件', '南华大学', '2018-01-01', '在职', '00000038', '5', '2019-01-01', null, '2018-01-01', '2023-01-01', null);
INSERT INTO `employee` VALUES ('1824', '林昭亮', '男', '1990-01-01', '610122199809091234', '已婚', '1', '广东', '13', '584991843@qq.com', '16767776654', '广东深圳', '91', '15', '33', '劳动合同', '大专', '计算机软件', '广东职业技术学院', '2018-01-01', '在职', '00000039', '5', '2018-04-01', null, '2018-01-01', '2023-01-01', null);
INSERT INTO `employee` VALUES ('1825', '11', '男', '2018-01-01', '610122201801011234', '已婚', '1', '1', '1', '584991843@qq.com', '111', '1', '89', '9', '29', '劳动合同', '本科', '1', '1', '2018-01-01', '在职', '00000040', '4', '2018-04-01', null, '2018-01-01', '2022-01-26', null);
INSERT INTO `employee` VALUES ('1826', '1', '男', '2018-01-01', '610188199809091234', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '89', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000041', '1', '2018-01-31', null, '2018-01-31', '2019-01-31', null);
INSERT INTO `employee` VALUES ('1827', '1', '男', '2018-01-01', '610122199909090000', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '78', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000042', '1', '2018-01-31', null, '2018-01-31', '2019-01-31', null);
INSERT INTO `employee` VALUES ('1828', '1', '男', '2018-01-01', '610122199909090000', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '81', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000043', '0', '2018-01-31', null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1829', '1', '男', '2018-01-01', '610122199909099999', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '87', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-01', '在职', '00000044', '0', '2018-01-01', null, '2018-01-01', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1830', '1', '男', '2018-01-01', '610122199909099999', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '78', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-01', '在职', '00000045', '0', '2018-01-01', null, '2018-01-01', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1831', '林伯渠', '男', '2018-01-01', '610122199909099999', '未婚', '1', '1', '1', '584991843@qq.com', '1', '1', '8', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000046', '0', '2018-01-31', null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1832', '1', '男', '2018-01-01', '610122199909091234', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '8', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000047', '0', '2018-01-31', null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1833', '江南一点雨', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000001', '2', null, null, '2018-01-01', '2020-01-01', null);
INSERT INTO `employee` VALUES ('1834', '陈静', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '8', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000002', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1835', '赵琳浩', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000003', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1836', '鹿存亮', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000004', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1837', '姚森', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '硕士', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000005', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1838', '云星', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000006', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1839', '贾旭明', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000007', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1840', '张黎明', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000008', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1841', '薛磊', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000009', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1842', '张洁', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000010', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1843', '江南一点雨2', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '91', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000011', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1844', '陈静2', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000012', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1845', '赵琳浩2', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000013', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1846', '鹿存亮2', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000014', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1847', '姚森2', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000015', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1848', '云星2', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000016', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1849', '贾旭明2', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000017', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1850', '王一亭', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000018', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1851', '薛磊2', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000019', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1852', '张洁2', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000020', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1853', '江南一点雨3', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000021', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1854', '陈静3', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000022', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1855', '鹿存亮3', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000024', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1856', '姚森3', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000025', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1857', '云星3', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000026', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1858', '贾旭明3', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000027', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1859', '张黎明3', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000028', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1860', '薛磊3', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000029', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1861', '江南一点雨4', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000031', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1862', '陈静4', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000032', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1863', '赵琳浩4', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000033', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1864', '鹿存亮4', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000034', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1865', '姚森4', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000035', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1866', '云星4', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000036', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1867', '贾旭明4', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000037', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1868', '张黎明2', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000038', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1869', '薛磊4', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000039', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1870', '张洁4', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000040', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1871', '江南一点雨5', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000041', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1872', '陈静5', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000042', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1873', '赵琳浩5', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000043', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1874', '鹿存亮5', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000044', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1875', '姚森5', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000045', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1876', '云星5', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000046', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1877', '贾旭明5', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000047', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1878', '张黎明5', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000048', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1879', '薛磊5', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000049', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1880', '张洁5', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000050', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1881', '江南一点雨6', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000051', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1882', '陈静6', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000052', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1883', '赵琳浩6', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000053', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1884', '鹿存亮6', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000054', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1885', '姚森6', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000055', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1886', '云星6', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000056', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1887', '江南一点雨', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000001', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1888', '陈静', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000002', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1889', '赵琳浩', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000003', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1890', '鹿存亮', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000004', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1891', '姚森', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000005', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1892', '贾旭明', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000007', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1893', '张黎明', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000008', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1894', '薛磊', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000009', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1895', '张洁', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000010', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1896', '江南一点雨2', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000011', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1897', '陈静2', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000012', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1898', '赵琳浩2', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000013', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1899', '鹿存亮2', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000014', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1900', '姚森2', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000015', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1901', '云星2', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000016', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1902', '贾旭明2', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000017', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1903', '王一亭', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000018', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1904', '薛磊2', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000019', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1905', '张洁2', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000020', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1906', '江南一点雨3', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000021', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1907', '陈静3', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000022', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1908', '鹿存亮3', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000024', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1909', '姚森3', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000025', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1910', '云星3', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000026', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1911', '贾旭明3', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000027', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1912', '张黎明3', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000028', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1913', '薛磊3', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000029', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1914', '江南一点雨4', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000031', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1915', '陈静4', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000032', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1916', '赵琳浩4', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000033', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1917', '鹿存亮4', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000034', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1918', '姚森4', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000035', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1919', '云星4', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000036', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1920', '贾旭明4', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000037', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1921', '谢工', '女', '1970-01-01', '618177197001011234', '离异', '1', '江苏', '1', '584991843@qq.com', '18558887788', '北京', '91', '12', '29', '劳动合同', '本科', '计算机软件', '南华大学', '2018-01-01', '在职', '00000038', '5', null, null, '2018-01-01', '2023-01-01', null);
INSERT INTO `employee` VALUES ('1922', '林昭亮', '男', '1990-01-01', '610122199809091234', '已婚', '1', '广东', '13', '584991843@qq.com', '16767776654', '广东深圳', '91', '15', '33', '劳动合同', '大专', '计算机软件', '广东职业技术学院', '2018-01-01', '在职', '00000039', '5', null, null, '2018-01-01', '2023-01-01', null);
INSERT INTO `employee` VALUES ('1923', '11', '男', '2018-01-01', '610122201801011234', '已婚', '1', '1', '1', '584991843@qq.com', '111', '1', '89', '9', '29', '劳动合同', '本科', '1', '1', '2018-01-01', '在职', '00000040', '4', null, null, '2018-01-01', '2022-01-26', null);
INSERT INTO `employee` VALUES ('1924', '1', '男', '2018-01-01', '610188199809091234', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '89', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000041', '1', null, null, '2018-01-31', '2019-01-31', null);
INSERT INTO `employee` VALUES ('1925', '1', '男', '2018-01-01', '610122199909090000', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '78', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000042', '1', null, null, '2018-01-31', '2019-01-31', null);
INSERT INTO `employee` VALUES ('1926', '1', '男', '2018-01-01', '610122199909090000', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '81', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000043', '0', null, null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1927', '1', '男', '2018-01-01', '610122199909099999', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '87', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-01', '在职', '00000044', '0', null, null, '2018-01-01', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1928', '1', '男', '2018-01-01', '610122199909099999', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '78', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-01', '在职', '00000045', '0', null, null, '2018-01-01', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1929', '林伯渠', '男', '2018-01-01', '610122199909099999', '未婚', '1', '1', '1', '584991843@qq.com', '1', '1', '8', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000046', '0', null, null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1930', '1', '男', '2018-01-01', '610122199909091234', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '8', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000047', '0', null, null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('1931', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000057', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('1932', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '93', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2019-11-05', '在职', '00000058', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('1933', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '93', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2019-11-05', '在职', '00000059', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('1934', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowan@123.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000060', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('1935', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowan@123.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000060', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('1936', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '91', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000061', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('1937', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '91', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000062', '6.17', '2018-03-31', null, '2017-12-31', '2024-02-29', null);
INSERT INTO `employee` VALUES ('1938', 'javaboy666', '男', '2019-11-10', '610122199911111111', '已婚', '1', '广东', '13', '123@qq.com', '12345678901', '广东深圳', '78', '9', '29', '劳动合同', '本科', '信管', '深圳大学', '2019-11-10', '在职', '00000063', '3.25', '2020-02-10', null, '2019-11-10', '2023-02-22', null);
INSERT INTO `employee` VALUES ('1939', 'javaboy666', '男', '2019-11-10', '610122199911111111', '已婚', '1', '广东', '13', '123@qq.com', '12345678901', '广东深圳', '78', '9', '29', '劳动合同', '本科', '信管', '深圳大学', '2019-11-10', '在职', '00000063', '3.25', '2020-02-10', null, '2019-11-10', '2023-02-22', null);
INSERT INTO `employee` VALUES ('1940', 'javaboy', '男', '2017-11-01', '610144199905059999', '已婚', '1', '广东', '13', '584991843@qq.com', '18564447789', '广东深圳', '85', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2019-11-24', '在职', '00000064', '3', '2020-01-10', null, '2019-11-24', '2022-11-27', null);
INSERT INTO `employee` VALUES ('1941', 'javaboy', '男', '2019-11-24', '610144199905056666', '已婚', '1', '广东', '13', '584991843@qq.com', '18566667777', '广东深圳', '89', '9', '29', '劳动合同', '本科', '计算机科学', '深圳大学', '2019-11-24', '在职', '00000065', '3', '2020-02-23', null, '2019-11-24', '2022-11-27', null);
INSERT INTO `employee` VALUES ('1942', 'Cyrus', '男', '2025-03-11', '430302200210254894', '未婚', '1', '汉族', '13', '2835568549@qq.com', '19310223117', '1', '91', '9', '29', '劳动合同', '本科', '11', 'jj', '2025-03-19', '在职', '00000066', '0', '2025-03-19', null, '2025-03-19', '2025-03-31', null);
INSERT INTO `employee` VALUES ('1943', 'Fan', '男', '2025-03-27', '430302200211112444', '未婚', '1', 'han', '13', '2835568549@qq.com', '15575481179', '123', '91', '9', '29', '劳动合同', '本科', '软件工程', '南华大学', '2025-03-27', '在职', '00000067', '0', '2025-03-27', null, '2025-03-27', '2025-03-31', null);
INSERT INTO `employee` VALUES ('1944', 'Fan', '男', '2025-03-27', '430302200211112444', '未婚', '1', 'han', '13', '2835568549@qq.com', '15575481179', '123', '91', '9', '29', '劳动合同', '本科', '软件工程', '南华大学', '2025-03-27', '在职', '00000068', '0', '2025-03-27', null, '2025-03-27', '2025-03-31', null);
INSERT INTO `employee` VALUES ('1945', 'Fan2', '女', '2025-03-27', '430302200211112444', '未婚', '1', 'han', '13', '2835568549@qq.com', '15575481179', '123', '93', '9', '29', '劳动合同', '硕士', '软件工程', '南华大学', '2025-03-27', '在职', '00000069', '0', '2025-03-27', null, '2025-03-27', '2025-03-31', null);
INSERT INTO `employee` VALUES ('1946', '姚森', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '硕士', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000005', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1947', '江南一点雨3', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000021', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1948', '贾旭明5', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000047', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1949', '云星', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000006', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1950', '云星6', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000056', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1951', '贾旭明', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000007', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1952', '赵琳浩4', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000033', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1953', '张黎明', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000008', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1954', '鹿存亮4', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000034', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1955', '江南一点雨', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000001', '2', '2018-04-01', null, '2018-01-01', '2020-01-01', null);
INSERT INTO `employee` VALUES ('1956', '薛磊', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000009', '6', '2018-04-01', null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1957', '赵琳浩5', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000043', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1958', '陈静', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '91', '12', '29', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000002', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1959', '张洁', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000010', '1', '2018-01-31', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1960', '鹿存亮5', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000044', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1961', '陈静6', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000052', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1962', '赵琳浩', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000003', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1963', '江南一点雨2', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '91', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000011', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1964', '姚森5', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000045', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1965', '赵琳浩6', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000053', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1966', '鹿存亮', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000004', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1967', '鹿存亮6', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000054', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1968', '赵琳浩2', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000013', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1969', '江南一点雨4', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000031', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1970', '薛磊4', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000039', '6', '2018-04-01', null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1971', '姚森6', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000055', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1972', '张黎明', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000008', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1973', '云星2', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000016', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1974', '姚森3', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000025', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1975', '鹿存亮4', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000034', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1976', '1', '男', '2018-01-01', '610122199909090000', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '78', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000042', '1', '2018-01-31', null, '2018-01-31', '2019-01-31', null);
INSERT INTO `employee` VALUES ('1977', '赵琳浩', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000003', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1978', '江南一点雨2', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '91', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000011', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1979', '薛磊2', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000019', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1980', '张黎明3', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000028', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1981', '贾旭明4', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000037', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1982', '姚森5', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000045', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1983', '赵琳浩6', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000053', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1984', '姚森', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000005', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1985', '鹿存亮2', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000014', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1986', '陈静3', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000022', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1987', '陈静4', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000032', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1988', '11', '男', '2018-01-01', '610122201801011234', '已婚', '1', '1', '1', '584991843@qq.com', '111', '1', '89', '9', '29', '劳动合同', '本科', '1', '1', '2018-01-01', '在职', '00000040', '4', null, null, '2018-01-01', '2022-01-26', null);
INSERT INTO `employee` VALUES ('1989', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000057', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('1990', 'javaboy666', '男', '2019-11-10', '610122199911111111', '已婚', '1', '广东', '13', '123@qq.com', '12345678901', '广东深圳', '78', '9', '29', '劳动合同', '本科', '信管', '深圳大学', '2019-11-10', '在职', '00000063', '3.25', '2020-02-10', null, '2019-11-10', '2023-02-22', null);
INSERT INTO `employee` VALUES ('1991', '张黎明', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000008', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('1992', '云星2', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000016', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('1993', '姚森3', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000025', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('1994', '鹿存亮4', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000034', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('1995', '陈静5', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000042', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1996', '张洁5', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000050', '1', '2018-01-31', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1997', '陈静', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000002', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('1998', '江南一点雨2', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000011', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('1999', '薛磊2', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000019', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2000', '张黎明3', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000028', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2001', '贾旭明4', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000037', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2002', '1', '男', '2018-01-01', '610122199909099999', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '78', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-01', '在职', '00000045', '0', '2018-01-01', null, '2018-01-01', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2003', '云星', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000006', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2004', '鹿存亮2', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000014', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2005', '陈静3', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000022', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2006', '陈静4', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000032', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2007', '张洁4', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000040', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2008', '张黎明5', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000048', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2009', '云星6', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000056', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2010', '薛磊', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000009', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2011', '贾旭明2', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000017', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2012', '云星3', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000026', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2013', '姚森4', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000035', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2014', '1', '男', '2018-01-01', '610122199909090000', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '81', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000043', '0', null, null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2015', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowan@123.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000060', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('2016', '赵琳浩', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000003', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2017', '江南一点雨2', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '91', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000011', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2018', '薛磊2', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000019', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2019', '张黎明3', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000028', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2020', '贾旭明4', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000037', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2021', '姚森5', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000045', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2022', '赵琳浩6', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000053', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2023', '姚森', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000005', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2024', '鹿存亮2', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000014', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2025', '陈静3', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000022', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2026', '陈静4', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000032', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2027', '11', '男', '2018-01-01', '610122201801011234', '已婚', '1', '1', '1', '584991843@qq.com', '111', '1', '89', '9', '29', '劳动合同', '本科', '1', '1', '2018-01-01', '在职', '00000040', '4', '2018-04-01', null, '2018-01-01', '2022-01-26', null);
INSERT INTO `employee` VALUES ('2028', '江南一点雨', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000001', '2', null, null, '2018-01-01', '2020-01-01', null);
INSERT INTO `employee` VALUES ('2029', '薛磊', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000009', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2030', '贾旭明2', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000017', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2031', '云星3', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000026', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2032', '姚森4', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000035', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2033', '赵琳浩5', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000043', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2034', '江南一点雨6', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000051', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2035', '赵琳浩', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000003', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2036', '陈静2', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000012', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2037', '张洁2', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000020', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2038', '薛磊3', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000029', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2039', '谢工', '女', '1970-01-01', '618177197001011234', '离异', '1', '江苏', '1', '584991843@qq.com', '18558887788', '北京', '91', '12', '29', '劳动合同', '本科', '计算机软件', '南华大学', '2018-01-01', '在职', '00000038', '5', null, null, '2018-01-01', '2023-01-01', null);
INSERT INTO `employee` VALUES ('2040', '林伯渠', '男', '2018-01-01', '610122199909099999', '未婚', '1', '1', '1', '584991843@qq.com', '1', '1', '8', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000046', '0', null, null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2041', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '91', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000062', '6.17', '2018-03-31', null, '2017-12-31', '2024-02-29', null);
INSERT INTO `employee` VALUES ('2042', 'Fan2', '女', '2025-03-27', '430302200211112444', '未婚', '1', 'han', '13', '2835568549@qq.com', '15575481179', '123', '93', '9', '29', '劳动合同', '硕士', '软件工程', '南华大学', '2025-03-27', '在职', '00000069', '0', '2025-03-27', null, '2025-03-27', '2025-03-31', null);
INSERT INTO `employee` VALUES ('2043', '鹿存亮2', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000014', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2044', '陈静3', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000022', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2045', '陈静4', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000032', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2046', '张洁4', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000040', '1', '2018-01-31', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2047', '张黎明5', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000048', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2048', '薛磊', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000009', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2049', '贾旭明2', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000017', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2050', '云星3', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000026', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2051', '姚森4', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000035', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2052', '1', '男', '2018-01-01', '610122199909090000', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '81', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000043', '0', '2018-01-31', null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2053', '鹿存亮', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000004', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2054', '陈静2', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000012', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2055', '张洁2', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000020', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2056', '薛磊3', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000029', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2057', '张黎明2', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000038', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2058', '云星5', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000046', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2059', '鹿存亮6', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000054', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2060', '贾旭明', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000007', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2061', '姚森2', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000015', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2062', '鹿存亮3', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000024', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2063', '赵琳浩4', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000033', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2064', '1', '男', '2018-01-01', '610188199809091234', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '89', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000041', '1', null, null, '2018-01-31', '2019-01-31', null);
INSERT INTO `employee` VALUES ('2065', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '93', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2019-11-05', '在职', '00000058', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('2066', '江南一点雨', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000001', '2', '2018-04-01', null, '2018-01-01', '2020-01-01', null);
INSERT INTO `employee` VALUES ('2067', '薛磊', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000009', '6', '2018-04-01', null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2068', '贾旭明2', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000017', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2069', '云星3', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000026', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2070', '姚森4', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000035', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2071', '赵琳浩5', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000043', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2072', '江南一点雨6', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000051', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2073', '赵琳浩', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000003', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2074', '陈静2', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000012', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2075', '张洁2', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000020', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2076', '薛磊3', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000029', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2077', '谢工', '女', '1970-01-01', '618177197001011234', '离异', '1', '江苏', '1', '584991843@qq.com', '18558887788', '北京', '91', '12', '29', '劳动合同', '本科', '计算机软件', '南华大学', '2018-01-01', '在职', '00000038', '5', '2019-01-01', null, '2018-01-01', '2023-01-01', null);
INSERT INTO `employee` VALUES ('2078', '林伯渠', '男', '2018-01-01', '610122199909099999', '未婚', '1', '1', '1', '584991843@qq.com', '1', '1', '8', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000046', '0', '2018-01-31', null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2079', '贾旭明', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000007', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2080', '姚森2', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000015', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2081', '鹿存亮3', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000024', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2082', '赵琳浩4', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000033', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2083', '江南一点雨5', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000041', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2084', '薛磊5', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000049', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2085', '江南一点雨', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000001', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2086', '张洁', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000010', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2087', '王一亭', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000018', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2088', '贾旭明3', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000027', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2089', '云星4', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000036', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2090', '1', '男', '2018-01-01', '610122199909099999', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '87', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-01', '在职', '00000044', '0', null, null, '2018-01-01', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2091', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowan@123.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000060', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('2092', '鹿存亮', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000004', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2093', '陈静2', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000012', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2094', '张洁2', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000020', '1', '2018-01-31', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2095', '薛磊3', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000029', '6', '2018-04-01', null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2096', '张黎明2', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000038', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2097', '云星5', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000046', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2098', '鹿存亮6', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000054', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2099', '贾旭明', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000007', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2100', '姚森2', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000015', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2101', '鹿存亮3', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000024', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2102', '赵琳浩4', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000033', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2103', '1', '男', '2018-01-01', '610188199809091234', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '89', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000041', '1', '2018-01-31', null, '2018-01-31', '2019-01-31', null);
INSERT INTO `employee` VALUES ('2104', '陈静', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '8', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000002', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2105', '张洁', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000010', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2106', '王一亭', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000018', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2107', '贾旭明3', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000027', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2108', '云星4', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000036', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2109', '鹿存亮5', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000044', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2110', '陈静6', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000052', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2111', '鹿存亮', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000004', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2112', '赵琳浩2', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000013', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2113', '江南一点雨3', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000021', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2114', '江南一点雨4', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000031', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2115', '林昭亮', '男', '1990-01-01', '610122199809091234', '已婚', '1', '广东', '13', '584991843@qq.com', '16767776654', '广东深圳', '91', '15', '33', '劳动合同', '大专', '计算机软件', '广东职业技术学院', '2018-01-01', '在职', '00000039', '5', null, null, '2018-01-01', '2023-01-01', null);
INSERT INTO `employee` VALUES ('2116', '1', '男', '2018-01-01', '610122199909091234', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '8', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000047', '0', null, null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2117', 'javaboy666', '男', '2019-11-10', '610122199911111111', '已婚', '1', '广东', '13', '123@qq.com', '12345678901', '广东深圳', '78', '9', '29', '劳动合同', '本科', '信管', '深圳大学', '2019-11-10', '在职', '00000063', '3.25', '2020-02-10', null, '2019-11-10', '2023-02-22', null);
INSERT INTO `employee` VALUES ('2118', '姚森2', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000015', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2119', '鹿存亮3', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000024', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2120', '江南一点雨5', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000041', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2121', '薛磊5', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000049', '6', '2018-04-01', null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2122', '江南一点雨', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000001', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2123', '张洁', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000010', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2124', '王一亭', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000018', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2125', '贾旭明3', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000027', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2126', '云星4', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000036', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2127', '1', '男', '2018-01-01', '610122199909099999', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '87', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-01', '在职', '00000044', '0', '2018-01-01', null, '2018-01-01', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2128', '姚森', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '硕士', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000005', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2129', '赵琳浩2', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000013', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2130', '江南一点雨3', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000021', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2131', '江南一点雨4', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000031', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2132', '薛磊4', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000039', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2133', '贾旭明5', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000047', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2134', '姚森6', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000055', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2135', '张黎明', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000008', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2136', '云星2', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000016', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2137', '姚森3', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000025', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2138', '鹿存亮4', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000034', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2139', '1', '男', '2018-01-01', '610122199909090000', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '78', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000042', '1', null, null, '2018-01-31', '2019-01-31', null);
INSERT INTO `employee` VALUES ('2140', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '93', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2019-11-05', '在职', '00000059', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('2141', '陈静', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '91', '12', '29', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000002', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2142', '张洁', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000010', '1', '2018-01-31', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2143', '王一亭', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000018', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2144', '贾旭明3', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000027', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2145', '云星4', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000036', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2146', '鹿存亮5', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000044', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2147', '陈静6', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000052', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2148', '鹿存亮', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000004', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2149', '赵琳浩2', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000013', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2150', '江南一点雨3', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000021', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2151', '江南一点雨4', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000031', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2152', '林昭亮', '男', '1990-01-01', '610122199809091234', '已婚', '1', '广东', '13', '584991843@qq.com', '16767776654', '广东深圳', '91', '15', '33', '劳动合同', '大专', '计算机软件', '广东职业技术学院', '2018-01-01', '在职', '00000039', '5', '2018-04-01', null, '2018-01-01', '2023-01-01', null);
INSERT INTO `employee` VALUES ('2153', '1', '男', '2018-01-01', '610122199909091234', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '8', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000047', '0', '2018-01-31', null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2154', '张黎明', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000008', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2155', '云星2', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000016', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2156', '姚森3', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000025', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2157', '鹿存亮4', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000034', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2158', '陈静5', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000042', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2159', '张洁5', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000050', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2160', '陈静', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000002', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2161', '江南一点雨2', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000011', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2162', '薛磊2', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000019', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2163', '张黎明3', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000028', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2164', '贾旭明4', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000037', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2165', '1', '男', '2018-01-01', '610122199909099999', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '78', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-01', '在职', '00000045', '0', null, null, '2018-01-01', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2166', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '91', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000061', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('2167', '姚森', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '硕士', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000005', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2168', '赵琳浩2', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000013', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2169', '江南一点雨3', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000021', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2170', '江南一点雨4', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000031', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2171', '薛磊4', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000039', '6', '2018-04-01', null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2172', '贾旭明5', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000047', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2173', '姚森6', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000055', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2174', '张黎明', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000008', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2175', '云星2', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000016', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2176', '姚森3', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000025', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2177', '鹿存亮4', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000034', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2178', '1', '男', '2018-01-01', '610122199909090000', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '78', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000042', '1', '2018-01-31', null, '2018-01-31', '2019-01-31', null);
INSERT INTO `employee` VALUES ('2179', '赵琳浩', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000003', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2180', '江南一点雨2', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '91', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000011', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2181', '薛磊2', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000019', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2182', '张黎明3', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000028', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2183', '贾旭明4', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000037', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2184', '姚森5', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000045', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2185', '赵琳浩6', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000053', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2186', '姚森', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000005', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2187', '鹿存亮2', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000014', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2188', '陈静3', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000022', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2189', '陈静4', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000032', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2190', '11', '男', '2018-01-01', '610122201801011234', '已婚', '1', '1', '1', '584991843@qq.com', '111', '1', '89', '9', '29', '劳动合同', '本科', '1', '1', '2018-01-01', '在职', '00000040', '4', null, null, '2018-01-01', '2022-01-26', null);
INSERT INTO `employee` VALUES ('2191', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000057', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('2192', 'javaboy666', '男', '2019-11-10', '610122199911111111', '已婚', '1', '广东', '13', '123@qq.com', '12345678901', '广东深圳', '78', '9', '29', '劳动合同', '本科', '信管', '深圳大学', '2019-11-10', '在职', '00000063', '3.25', '2020-02-10', null, '2019-11-10', '2023-02-22', null);
INSERT INTO `employee` VALUES ('2193', '云星2', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000016', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2194', '姚森3', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000025', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2195', '陈静5', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000042', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2196', '张洁5', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000050', '1', '2018-01-31', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2197', '陈静', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000002', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2198', '江南一点雨2', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000011', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2199', '薛磊2', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000019', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2200', '张黎明3', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000028', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2201', '贾旭明4', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000037', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2202', '1', '男', '2018-01-01', '610122199909099999', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '78', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-01', '在职', '00000045', '0', '2018-01-01', null, '2018-01-01', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2203', '云星', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000006', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2204', '鹿存亮2', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000014', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2205', '陈静3', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000022', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2206', '陈静4', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000032', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2207', '张洁4', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000040', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2208', '张黎明5', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000048', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2209', '云星6', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000056', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2210', '薛磊', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000009', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2211', '贾旭明2', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000017', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2212', '云星3', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000026', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2213', '姚森4', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000035', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2214', '1', '男', '2018-01-01', '610122199909090000', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '81', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000043', '0', null, null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2215', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowan@123.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000060', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('2216', '赵琳浩', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000003', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2217', '江南一点雨2', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '91', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000011', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2218', '薛磊2', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000019', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2219', '张黎明3', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000028', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2220', '贾旭明4', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000037', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2221', '姚森5', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000045', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2222', '赵琳浩6', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000053', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2223', '姚森', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000005', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2224', '鹿存亮2', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000014', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2225', '陈静3', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000022', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2226', '陈静4', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000032', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2227', '11', '男', '2018-01-01', '610122201801011234', '已婚', '1', '1', '1', '584991843@qq.com', '111', '1', '89', '9', '29', '劳动合同', '本科', '1', '1', '2018-01-01', '在职', '00000040', '4', '2018-04-01', null, '2018-01-01', '2022-01-26', null);
INSERT INTO `employee` VALUES ('2228', '江南一点雨', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000001', '2', null, null, '2018-01-01', '2020-01-01', null);
INSERT INTO `employee` VALUES ('2229', '薛磊', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000009', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2230', '贾旭明2', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000017', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2231', '云星3', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000026', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2232', '姚森4', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000035', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2233', '赵琳浩5', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000043', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2234', '江南一点雨6', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000051', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2235', '赵琳浩', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000003', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2236', '陈静2', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000012', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2237', '张洁2', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000020', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2238', '薛磊3', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000029', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2239', '谢工', '女', '1970-01-01', '618177197001011234', '离异', '1', '江苏', '1', '584991843@qq.com', '18558887788', '北京', '91', '12', '29', '劳动合同', '本科', '计算机软件', '南华大学', '2018-01-01', '在职', '00000038', '5', null, null, '2018-01-01', '2023-01-01', null);
INSERT INTO `employee` VALUES ('2240', '林伯渠', '男', '2018-01-01', '610122199909099999', '未婚', '1', '1', '1', '584991843@qq.com', '1', '1', '8', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000046', '0', null, null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2241', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '91', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000062', '6.17', '2018-03-31', null, '2017-12-31', '2024-02-29', null);
INSERT INTO `employee` VALUES ('2242', '云星', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000006', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2243', '鹿存亮2', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000014', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2244', '陈静3', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000022', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2245', '陈静4', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000032', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2246', '张洁4', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000040', '1', '2018-01-31', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2247', '张黎明5', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000048', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2248', '云星6', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000056', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2249', '薛磊', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000009', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2250', '贾旭明2', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000017', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2251', '云星3', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000026', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2252', '姚森4', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000035', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2253', '1', '男', '2018-01-01', '610122199909090000', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '81', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000043', '0', '2018-01-31', null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2254', '鹿存亮', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000004', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2255', '陈静2', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000012', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2256', '张洁2', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000020', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2257', '薛磊3', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000029', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2258', '张黎明2', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000038', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2259', '云星5', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000046', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2260', '鹿存亮6', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000054', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2261', '贾旭明', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000007', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2262', '姚森2', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000015', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2263', '鹿存亮3', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000024', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2264', '赵琳浩4', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000033', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2265', '1', '男', '2018-01-01', '610188199809091234', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '89', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000041', '1', null, null, '2018-01-31', '2019-01-31', null);
INSERT INTO `employee` VALUES ('2266', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '93', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2019-11-05', '在职', '00000058', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('2267', 'javaboy', '男', '2017-11-01', '610144199905059999', '已婚', '1', '广东', '13', '584991843@qq.com', '18564447789', '广东深圳', '85', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2019-11-24', '在职', '00000064', '3', '2020-01-10', null, '2019-11-24', '2022-11-27', null);
INSERT INTO `employee` VALUES ('2268', '贾旭明2', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000017', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2269', '云星3', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000026', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2270', '姚森4', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000035', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2271', '江南一点雨6', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000051', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2272', '赵琳浩', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000003', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2273', '陈静2', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000012', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2274', '张洁2', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000020', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2275', '薛磊3', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000029', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2276', '谢工', '女', '1970-01-01', '618177197001011234', '离异', '1', '江苏', '1', '584991843@qq.com', '18558887788', '北京', '91', '12', '29', '劳动合同', '本科', '计算机软件', '南华大学', '2018-01-01', '在职', '00000038', '5', '2019-01-01', null, '2018-01-01', '2023-01-01', null);
INSERT INTO `employee` VALUES ('2277', '林伯渠', '男', '2018-01-01', '610122199909099999', '未婚', '1', '1', '1', '584991843@qq.com', '1', '1', '8', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000046', '0', '2018-01-31', null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2278', '贾旭明', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000007', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2279', '姚森2', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000015', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2280', '鹿存亮3', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000024', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2281', '赵琳浩4', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000033', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2282', '江南一点雨5', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000041', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2283', '薛磊5', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000049', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2284', '江南一点雨', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000001', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2285', '张洁', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000010', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2286', '王一亭', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000018', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2287', '贾旭明3', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000027', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2288', '云星4', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000036', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2289', '1', '男', '2018-01-01', '610122199909099999', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '87', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-01', '在职', '00000044', '0', null, null, '2018-01-01', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2290', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowan@123.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000060', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('2291', '鹿存亮', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000004', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2292', '陈静2', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000012', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2293', '张洁2', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000020', '1', '2018-01-31', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2294', '薛磊3', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000029', '6', '2018-04-01', null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2295', '张黎明2', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000038', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2296', '云星5', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000046', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2297', '鹿存亮6', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000054', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2298', '贾旭明', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000007', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2299', '姚森2', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000015', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2300', '鹿存亮3', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000024', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2301', '赵琳浩4', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000033', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2302', '1', '男', '2018-01-01', '610188199809091234', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '89', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000041', '1', '2018-01-31', null, '2018-01-31', '2019-01-31', null);
INSERT INTO `employee` VALUES ('2303', '陈静', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '8', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000002', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2304', '张洁', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000010', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2305', '王一亭', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000018', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2306', '贾旭明3', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000027', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2307', '云星4', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000036', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2308', '鹿存亮5', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000044', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2309', '陈静6', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000052', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2310', '鹿存亮', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000004', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2311', '赵琳浩2', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000013', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2312', '江南一点雨3', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000021', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2313', '江南一点雨4', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000031', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2314', '林昭亮', '男', '1990-01-01', '610122199809091234', '已婚', '1', '广东', '13', '584991843@qq.com', '16767776654', '广东深圳', '91', '15', '33', '劳动合同', '大专', '计算机软件', '广东职业技术学院', '2018-01-01', '在职', '00000039', '5', null, null, '2018-01-01', '2023-01-01', null);
INSERT INTO `employee` VALUES ('2315', '1', '男', '2018-01-01', '610122199909091234', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '8', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000047', '0', null, null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2316', 'javaboy666', '男', '2019-11-10', '610122199911111111', '已婚', '1', '广东', '13', '123@qq.com', '12345678901', '广东深圳', '78', '9', '29', '劳动合同', '本科', '信管', '深圳大学', '2019-11-10', '在职', '00000063', '3.25', '2020-02-10', null, '2019-11-10', '2023-02-22', null);
INSERT INTO `employee` VALUES ('2317', '贾旭明', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000007', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2318', '姚森2', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000015', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2319', '鹿存亮3', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000024', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2320', '赵琳浩4', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000033', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2321', '江南一点雨5', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000041', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2322', '薛磊5', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000049', '6', '2018-04-01', null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2323', '江南一点雨', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000001', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2324', '张洁', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000010', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2325', '王一亭', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000018', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2326', '贾旭明3', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000027', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2327', '云星4', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000036', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2328', '1', '男', '2018-01-01', '610122199909099999', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '87', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-01', '在职', '00000044', '0', '2018-01-01', null, '2018-01-01', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2329', '姚森', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '硕士', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000005', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2330', '赵琳浩2', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000013', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2331', '江南一点雨3', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000021', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2332', '江南一点雨4', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000031', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2333', '薛磊4', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000039', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2334', '贾旭明5', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000047', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2335', '姚森6', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000055', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2336', '张黎明', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000008', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2337', '云星2', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000016', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2338', '姚森3', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000025', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2339', '鹿存亮4', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000034', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2340', '1', '男', '2018-01-01', '610122199909090000', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '78', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000042', '1', null, null, '2018-01-31', '2019-01-31', null);
INSERT INTO `employee` VALUES ('2341', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '93', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2019-11-05', '在职', '00000059', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('2342', 'javaboy', '男', '2019-11-24', '610144199905056666', '已婚', '1', '广东', '13', '584991843@qq.com', '18566667777', '广东深圳', '89', '9', '29', '劳动合同', '本科', '计算机科学', '深圳大学', '2019-11-24', '在职', '00000065', '3', '2020-02-23', null, '2019-11-24', '2022-11-27', null);
INSERT INTO `employee` VALUES ('2343', '王一亭', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000018', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2344', '贾旭明3', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000027', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2345', '云星4', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000036', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2346', '鹿存亮', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000004', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2347', '赵琳浩2', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000013', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2348', '江南一点雨3', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000021', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2349', '江南一点雨4', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000031', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2350', '林昭亮', '男', '1990-01-01', '610122199809091234', '已婚', '1', '广东', '13', '584991843@qq.com', '16767776654', '广东深圳', '91', '15', '33', '劳动合同', '大专', '计算机软件', '广东职业技术学院', '2018-01-01', '在职', '00000039', '5', '2018-04-01', null, '2018-01-01', '2023-01-01', null);
INSERT INTO `employee` VALUES ('2351', '1', '男', '2018-01-01', '610122199909091234', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '8', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000047', '0', '2018-01-31', null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2352', '张黎明', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000008', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2353', '云星2', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000016', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2354', '姚森3', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000025', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2355', '鹿存亮4', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000034', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2356', '陈静5', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000042', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2357', '张洁5', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000050', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2358', '陈静', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000002', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2359', '江南一点雨2', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000011', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2360', '薛磊2', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000019', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2361', '张黎明3', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000028', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2362', '贾旭明4', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000037', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2363', '1', '男', '2018-01-01', '610122199909099999', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '78', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-01', '在职', '00000045', '0', null, null, '2018-01-01', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2364', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '91', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000061', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('2365', '姚森', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '硕士', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000005', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2366', '赵琳浩2', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000013', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2367', '江南一点雨3', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000021', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2368', '江南一点雨4', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000031', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2369', '薛磊4', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000039', '6', '2018-04-01', null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2370', '贾旭明5', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000047', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2371', '姚森6', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000055', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2372', '张黎明', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000008', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2373', '云星2', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000016', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2374', '姚森3', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000025', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2375', '鹿存亮4', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000034', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2376', '1', '男', '2018-01-01', '610122199909090000', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '78', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000042', '1', '2018-01-31', null, '2018-01-31', '2019-01-31', null);
INSERT INTO `employee` VALUES ('2377', '赵琳浩', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000003', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2378', '江南一点雨2', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '91', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000011', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2379', '薛磊2', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000019', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2380', '张黎明3', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000028', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2381', '贾旭明4', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000037', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2382', '姚森5', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000045', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2383', '赵琳浩6', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000053', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2384', '姚森', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000005', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2385', '鹿存亮2', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000014', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2386', '陈静3', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000022', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2387', '陈静4', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000032', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2388', '11', '男', '2018-01-01', '610122201801011234', '已婚', '1', '1', '1', '584991843@qq.com', '111', '1', '89', '9', '29', '劳动合同', '本科', '1', '1', '2018-01-01', '在职', '00000040', '4', null, null, '2018-01-01', '2022-01-26', null);
INSERT INTO `employee` VALUES ('2389', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000057', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('2390', 'javaboy666', '男', '2019-11-10', '610122199911111111', '已婚', '1', '广东', '13', '123@qq.com', '12345678901', '广东深圳', '78', '9', '29', '劳动合同', '本科', '信管', '深圳大学', '2019-11-10', '在职', '00000063', '3.25', '2020-02-10', null, '2019-11-10', '2023-02-22', null);
INSERT INTO `employee` VALUES ('2391', '张黎明', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000008', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2392', '云星2', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000016', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2393', '姚森3', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000025', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2394', '鹿存亮4', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000034', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2395', '陈静5', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000042', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2396', '张洁5', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000050', '1', '2018-01-31', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2397', '陈静', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000002', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2398', '江南一点雨2', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000011', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2399', '薛磊2', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000019', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2400', '张黎明3', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000028', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2401', '贾旭明4', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000037', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2402', '1', '男', '2018-01-01', '610122199909099999', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '78', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-01', '在职', '00000045', '0', '2018-01-01', null, '2018-01-01', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2403', '云星', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000006', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2404', '鹿存亮2', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000014', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2405', '陈静3', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000022', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2406', '陈静4', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000032', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2407', '张洁4', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000040', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2408', '张黎明5', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000048', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2409', '云星6', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000056', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2410', '薛磊', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000009', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2411', '贾旭明2', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000017', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2412', '云星3', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000026', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2413', '姚森4', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000035', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2414', '1', '男', '2018-01-01', '610122199909090000', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '81', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000043', '0', null, null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2415', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowan@123.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000060', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('2416', 'Cyrus', '男', '2025-03-11', '430302200210254894', '未婚', '1', '汉族', '13', '2835568549@qq.com', '19310223117', '1', '91', '9', '29', '劳动合同', '本科', '11', 'jj', '2025-03-19', '在职', '00000066', '0', '2025-03-19', null, '2025-03-19', '2025-03-31', null);
INSERT INTO `employee` VALUES ('2417', '薛磊2', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000019', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2418', '张黎明3', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000028', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2419', '贾旭明4', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000037', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2420', '姚森', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000005', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2421', '鹿存亮2', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000014', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2422', '陈静3', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000022', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2423', '陈静4', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000032', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2424', '11', '男', '2018-01-01', '610122201801011234', '已婚', '1', '1', '1', '584991843@qq.com', '111', '1', '89', '9', '29', '劳动合同', '本科', '1', '1', '2018-01-01', '在职', '00000040', '4', '2018-04-01', null, '2018-01-01', '2022-01-26', null);
INSERT INTO `employee` VALUES ('2425', '江南一点雨', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000001', '2', null, null, '2018-01-01', '2020-01-01', null);
INSERT INTO `employee` VALUES ('2426', '薛磊', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000009', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2427', '贾旭明2', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000017', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2428', '云星3', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000026', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2429', '姚森4', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000035', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2430', '赵琳浩5', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000043', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2431', '江南一点雨6', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000051', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2432', '赵琳浩', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000003', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2433', '陈静2', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000012', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2434', '张洁2', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000020', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2435', '薛磊3', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000029', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2436', '谢工', '女', '1970-01-01', '618177197001011234', '离异', '1', '江苏', '1', '584991843@qq.com', '18558887788', '北京', '91', '12', '29', '劳动合同', '本科', '计算机软件', '南华大学', '2018-01-01', '在职', '00000038', '5', null, null, '2018-01-01', '2023-01-01', null);
INSERT INTO `employee` VALUES ('2437', '林伯渠', '男', '2018-01-01', '610122199909099999', '未婚', '1', '1', '1', '584991843@qq.com', '1', '1', '8', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000046', '0', null, null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2438', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '91', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000062', '6.17', '2018-03-31', null, '2017-12-31', '2024-02-29', null);
INSERT INTO `employee` VALUES ('2439', '云星', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000006', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2440', '鹿存亮2', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000014', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2441', '陈静3', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000022', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2442', '陈静4', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000032', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2443', '张洁4', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000040', '1', '2018-01-31', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2444', '张黎明5', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000048', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2445', '云星6', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000056', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2446', '薛磊', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000009', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2447', '贾旭明2', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000017', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2448', '云星3', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000026', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2449', '姚森4', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000035', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2450', '1', '男', '2018-01-01', '610122199909090000', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '81', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000043', '0', '2018-01-31', null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2451', '鹿存亮', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000004', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2452', '陈静2', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000012', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2453', '张洁2', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000020', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2454', '薛磊3', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000029', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2455', '张黎明2', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000038', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2456', '云星5', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000046', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2457', '鹿存亮6', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000054', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2458', '贾旭明', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000007', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2459', '姚森2', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000015', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2460', '鹿存亮3', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000024', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2461', '赵琳浩4', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000033', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2462', '1', '男', '2018-01-01', '610188199809091234', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '89', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000041', '1', null, null, '2018-01-31', '2019-01-31', null);
INSERT INTO `employee` VALUES ('2463', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '93', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2019-11-05', '在职', '00000058', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('2464', '江南一点雨', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000001', '2', '2018-04-01', null, '2018-01-01', '2020-01-01', null);
INSERT INTO `employee` VALUES ('2465', '薛磊', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000009', '6', '2018-04-01', null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2466', '贾旭明2', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000017', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2467', '云星3', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000026', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2468', '姚森4', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000035', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2469', '赵琳浩5', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000043', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2470', '江南一点雨6', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000051', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2471', '赵琳浩', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000003', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2472', '陈静2', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000012', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2473', '张洁2', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000020', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2474', '薛磊3', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000029', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2475', '谢工', '女', '1970-01-01', '618177197001011234', '离异', '1', '江苏', '1', '584991843@qq.com', '18558887788', '北京', '91', '12', '29', '劳动合同', '本科', '计算机软件', '南华大学', '2018-01-01', '在职', '00000038', '5', '2019-01-01', null, '2018-01-01', '2023-01-01', null);
INSERT INTO `employee` VALUES ('2476', '林伯渠', '男', '2018-01-01', '610122199909099999', '未婚', '1', '1', '1', '584991843@qq.com', '1', '1', '8', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000046', '0', '2018-01-31', null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2477', '贾旭明', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000007', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2478', '姚森2', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000015', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2479', '鹿存亮3', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000024', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2480', '赵琳浩4', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000033', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2481', '江南一点雨5', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000041', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2482', '薛磊5', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000049', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2483', '江南一点雨', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000001', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2484', '张洁', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000010', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2485', '王一亭', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000018', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2486', '贾旭明3', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000027', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2487', '云星4', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000036', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2488', '1', '男', '2018-01-01', '610122199909099999', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '87', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-01', '在职', '00000044', '0', null, null, '2018-01-01', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2489', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowan@123.com', '18565558897', '深圳市南山区', '5', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000060', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('2490', 'Fan', '男', '2025-03-27', '430302200211112444', '未婚', '1', 'han', '13', '2835568549@qq.com', '15575481179', '123', '91', '9', '29', '劳动合同', '本科', '软件工程', '南华大学', '2025-03-27', '在职', '00000067', '0', '2025-03-27', null, '2025-03-27', '2025-03-31', null);
INSERT INTO `employee` VALUES ('2491', '陈静2', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000012', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2492', '张洁2', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000020', '1', '2018-01-31', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2493', '薛磊3', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000029', '6', '2018-04-01', null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2494', '张黎明2', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000038', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2495', '云星5', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000046', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2496', '贾旭明', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000007', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2497', '姚森2', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000015', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2498', '鹿存亮3', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000024', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2499', '赵琳浩4', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000033', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2500', '1', '男', '2018-01-01', '610188199809091234', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '89', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000041', '1', '2018-01-31', null, '2018-01-31', '2019-01-31', null);
INSERT INTO `employee` VALUES ('2501', '陈静', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '8', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000002', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2502', '张洁', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000010', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2503', '王一亭', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000018', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2504', '贾旭明3', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000027', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2505', '云星4', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000036', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2506', '鹿存亮5', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000044', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2507', '陈静6', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000052', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2508', '鹿存亮', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000004', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2509', '赵琳浩2', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000013', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2510', '江南一点雨3', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000021', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2511', '江南一点雨4', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000031', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2512', '林昭亮', '男', '1990-01-01', '610122199809091234', '已婚', '1', '广东', '13', '584991843@qq.com', '16767776654', '广东深圳', '91', '15', '33', '劳动合同', '大专', '计算机软件', '广东职业技术学院', '2018-01-01', '在职', '00000039', '5', null, null, '2018-01-01', '2023-01-01', null);
INSERT INTO `employee` VALUES ('2513', '1', '男', '2018-01-01', '610122199909091234', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '8', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000047', '0', null, null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2514', 'javaboy666', '男', '2019-11-10', '610122199911111111', '已婚', '1', '广东', '13', '123@qq.com', '12345678901', '广东深圳', '78', '9', '29', '劳动合同', '本科', '信管', '深圳大学', '2019-11-10', '在职', '00000063', '3.25', '2020-02-10', null, '2019-11-10', '2023-02-22', null);
INSERT INTO `employee` VALUES ('2515', '贾旭明', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000007', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2516', '姚森2', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000015', '7', '2017-04-02', null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2517', '鹿存亮3', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000024', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2518', '赵琳浩4', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000033', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2519', '江南一点雨5', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000041', '1', '2018-04-01', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2520', '薛磊5', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000049', '6', '2018-04-01', null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2521', '江南一点雨', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000001', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2522', '张洁', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000010', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2523', '王一亭', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000018', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2524', '贾旭明3', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000027', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2525', '云星4', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000036', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2526', '1', '男', '2018-01-01', '610122199909099999', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '87', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-01', '在职', '00000044', '0', '2018-01-01', null, '2018-01-01', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2527', '姚森', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '硕士', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000005', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2528', '赵琳浩2', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000013', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2529', '江南一点雨3', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000021', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2530', '江南一点雨4', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000031', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2531', '薛磊4', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000039', '6', null, null, '2018-01-01', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2532', '贾旭明5', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000047', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2533', '姚森6', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000055', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2534', '张黎明', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000008', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2535', '云星2', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000016', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2536', '姚森3', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000025', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2537', '鹿存亮4', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000034', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2538', '1', '男', '2018-01-01', '610122199909090000', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '78', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000042', '1', null, null, '2018-01-31', '2019-01-31', null);
INSERT INTO `employee` VALUES ('2539', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '93', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2019-11-05', '在职', '00000059', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('2540', '陈静', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '91', '12', '29', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000002', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2541', '张洁', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000010', '1', '2018-01-31', null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2542', '王一亭', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000018', '7', '2018-04-01', null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2543', '贾旭明3', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000027', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2544', '云星4', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000036', '5.25', '2018-04-01', null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2545', '鹿存亮5', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000044', '3.5', '2018-04-01', null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2546', '陈静6', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000052', '3', '2015-09-10', null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2547', '鹿存亮', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000004', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2548', '赵琳浩2', '男', '1993-03-04', '610122199303041456', '未婚', '1', '陕西', '3', 'zhao@qq.com', '15698887795', '陕西省西安市莲湖区', '91', '12', '33', '劳动合同', '博士', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000013', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2549', '江南一点雨3', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000021', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2550', '江南一点雨4', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000031', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2551', '林昭亮', '男', '1990-01-01', '610122199809091234', '已婚', '1', '广东', '13', '584991843@qq.com', '16767776654', '广东深圳', '91', '15', '33', '劳动合同', '大专', '计算机软件', '广东职业技术学院', '2018-01-01', '在职', '00000039', '5', '2018-04-01', null, '2018-01-01', '2023-01-01', null);
INSERT INTO `employee` VALUES ('2552', '1', '男', '2018-01-01', '610122199909091234', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '8', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-31', '在职', '00000047', '0', '2018-01-31', null, '2018-01-31', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2553', '张黎明', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000008', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2554', '云星2', '女', '1993-01-05', '610122199301054789', '已婚', '1', '陕西西安', '1', 'yunxing@qq.com', '15644442252', '陕西西安新城区', '92', '16', '34', '劳务合同', '硕士', '通信工程', '西安电子科技学校', '2018-01-01', '在职', '00000016', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2555', '姚森3', '男', '1991-02-05', '610122199102058952', '已婚', '1', '河南', '3', 'yaosen@qq.com', '14785559936', '河南洛阳人民大道58号', '92', '15', '34', '劳动合同', '初中', '室内装修设计', '西北大学', '2017-01-02', '在职', '00000025', '7', null, null, '2017-01-02', '2024-01-17', null);
INSERT INTO `employee` VALUES ('2556', '鹿存亮4', '男', '1990-01-03', '610122199001031456', '已婚', '1', '陕西', '3', 'zhao@qq.com', '15612347795', '陕西省西安市莲湖区', '92', '12', '34', '劳动合同', '高中', '电子工程', '哈尔滨理工大学', '2018-01-01', '在职', '00000034', '3.5', null, null, '2018-01-01', '2021-07-14', null);
INSERT INTO `employee` VALUES ('2557', '陈静5', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000042', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2558', '张洁5', '女', '1990-10-09', '420177199010093652', '未婚', '1', '海南', '5', 'zhangjie@qq.com', '13695557742', '海口市美兰区', '92', '16', '34', '劳动合同', '高中', '无', '海南侨中', '2018-01-01', '在职', '00000050', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2559', '陈静', '女', '1989-02-01', '421288198902011234', '已婚', '1', '海南', '1', 'chenjing@qq.com', '18795556693', '海南省海口市美兰区', '82', '12', '30', '劳动合同', '高中', '市场营销', '武汉大学', '2015-06-09', '在职', '00000002', '3', null, null, '2015-06-09', '2018-06-08', null);
INSERT INTO `employee` VALUES ('2560', '江南一点雨2', '男', '1990-01-01', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '8', '9', '29', '劳动合同', '本科', '信息管理与信息系统', '深圳大学', '2018-01-01', '在职', '00000011', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2561', '薛磊2', '男', '1992-07-01', '610144199207017895', '已婚', '1', '陕西西安', '13', 'xuelei@qq.com', '15648887741', '西安市雁塔区', '92', '14', '34', '劳动合同', '初中', '无', '华胥中学', '2018-01-01', '在职', '00000019', '1', null, null, '2018-01-01', '2019-01-01', null);
INSERT INTO `employee` VALUES ('2562', '张黎明3', '男', '1991-02-01', '610144199102014569', '已婚', '1', '广东', '6', 'zhangliming@qq.com', '18979994478', '广东珠海', '91', '15', '33', '劳动合同', '高中', '考古', '清华大学', '2018-01-01', '在职', '00000028', '7', null, null, '2018-01-01', '2025-01-30', null);
INSERT INTO `employee` VALUES ('2563', '贾旭明4', '男', '1993-11-11', '610122199311111234', '已婚', '1', '广东广州', '4', 'jiaxuming@qq.com', '15644441234', '广东省广州市天河区冼村路', '78', '15', '33', '劳务合同', '初中', '通信工程', '西北大学', '2018-01-01', '在职', '00000037', '5.25', null, null, '2018-01-01', '2023-04-13', null);
INSERT INTO `employee` VALUES ('2564', '1', '男', '2018-01-01', '610122199909099999', '已婚', '1', '1', '1', '584991843@qq.com', '1', '1', '78', '9', '29', '劳动合同', '大专', '1', '1', '2018-01-01', '在职', '00000045', '0', null, null, '2018-01-01', '2018-01-31', null);
INSERT INTO `employee` VALUES ('2565', 'javaboy', '男', '1989-12-31', '610122199001011256', '已婚', '1', '陕西', '13', 'laowang@qq.com', '18565558897', '深圳市南山区', '91', '9', '29', '劳务合同', '本科', '信息管理与信息系统', '深圳大学', '2017-12-31', '在职', '00000061', '2', '2018-03-31', null, '2017-12-31', '2019-12-31', null);
INSERT INTO `employee` VALUES ('2566', 'Fan', '男', '2025-03-27', '430302200211112444', '未婚', '1', 'han', '13', '2835568549@qq.com', '15575481179', '123', '91', '9', '29', '劳动合同', '本科', '软件工程', '南华大学', '2025-03-27', '在职', '00000068', '0', '2025-03-27', null, '2025-03-27', '2025-03-31', null);

-- ----------------------------
-- Table structure for employeeec
-- ----------------------------
DROP TABLE IF EXISTS `employeeec`;
CREATE TABLE `employeeec` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `eid` int(11) DEFAULT NULL COMMENT '员工编号',
  `ecDate` date DEFAULT NULL COMMENT '奖罚日期',
  `ecReason` varchar(255) DEFAULT NULL COMMENT '奖罚原因',
  `ecPoint` int(11) DEFAULT NULL COMMENT '奖罚分',
  `ecType` int(11) DEFAULT NULL COMMENT '奖罚类别，0：奖，1：罚',
  `remark` varchar(255) DEFAULT NULL COMMENT '备注',
  PRIMARY KEY (`id`),
  KEY `pid` (`eid`),
  CONSTRAINT `employeeec_ibfk_1` FOREIGN KEY (`eid`) REFERENCES `employee` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of employeeec
-- ----------------------------
INSERT INTO `employeeec` VALUES ('1', '1', '2025-03-19', '业绩出色', '10', '0', '11');
INSERT INTO `employeeec` VALUES ('2', '2', '2025-03-19', '迟到', '5', '1', '下不为例');
INSERT INTO `employeeec` VALUES ('3', '3', '2025-03-20', '早退', '5', '1', '11');
INSERT INTO `employeeec` VALUES ('4', '1', '2025-03-25', '上班睡觉', '5', '1', '1');
INSERT INTO `employeeec` VALUES ('5', '1', '2025-04-01', '1', '8', '0', '');
INSERT INTO `employeeec` VALUES ('6', '2', '2025-03-25', '摸鱼严重', '6', '1', '摸鱼严重');
INSERT INTO `employeeec` VALUES ('7', '3', '2025-05-12', '迟到', '10', '1', '');
INSERT INTO `employeeec` VALUES ('8', '4', '2025-05-12', '工作完成迅速', '5', '0', '');
INSERT INTO `employeeec` VALUES ('9', '3', '2025-05-12', '11', '10', '1', '');

-- ----------------------------
-- Table structure for employeeremove
-- ----------------------------
DROP TABLE IF EXISTS `employeeremove`;
CREATE TABLE `employeeremove` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `eid` int(11) DEFAULT NULL,
  `afterDepId` int(11) DEFAULT NULL COMMENT '调动后部门',
  `afterJobId` int(11) DEFAULT NULL COMMENT '调动后职位',
  `removeDate` date DEFAULT NULL COMMENT '调动日期',
  `reason` varchar(255) DEFAULT NULL COMMENT '调动原因',
  `remark` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `pid` (`eid`),
  CONSTRAINT `employeeremove_ibfk_1` FOREIGN KEY (`eid`) REFERENCES `employee` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of employeeremove
-- ----------------------------
INSERT INTO `employeeremove` VALUES ('1', '2', null, null, '2025-03-19', '认为公司前景差', '1');
INSERT INTO `employeeremove` VALUES ('2', '56', null, null, '2025-03-22', '1', '1');
INSERT INTO `employeeremove` VALUES ('3', '4', null, null, '2025-05-19', '11', '');

-- ----------------------------
-- Table structure for employeetrain
-- ----------------------------
DROP TABLE IF EXISTS `employeetrain`;
CREATE TABLE `employeetrain` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `eid` int(11) DEFAULT NULL COMMENT '员工编号',
  `trainDate` date DEFAULT NULL COMMENT '培训日期',
  `trainContent` varchar(255) DEFAULT NULL COMMENT '培训内容',
  `remark` varchar(255) DEFAULT NULL COMMENT '备注',
  PRIMARY KEY (`id`),
  KEY `pid` (`eid`),
  CONSTRAINT `employeetrain_ibfk_1` FOREIGN KEY (`eid`) REFERENCES `employee` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of employeetrain
-- ----------------------------
INSERT INTO `employeetrain` VALUES ('1', '1', '2025-03-20', 'Java后端技能培训', '11');
INSERT INTO `employeetrain` VALUES ('2', '3', '2025-05-12', '工作态度培训', '');

-- ----------------------------
-- Table structure for empsalary
-- ----------------------------
DROP TABLE IF EXISTS `empsalary`;
CREATE TABLE `empsalary` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `eid` int(11) DEFAULT NULL,
  `sid` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `eid` (`eid`),
  KEY `empsalary_ibfk_2` (`sid`),
  CONSTRAINT `empsalary_ibfk_1` FOREIGN KEY (`eid`) REFERENCES `employee` (`id`),
  CONSTRAINT `empsalary_ibfk_2` FOREIGN KEY (`sid`) REFERENCES `salary` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=40 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of empsalary
-- ----------------------------
INSERT INTO `empsalary` VALUES ('6', '4', '10');
INSERT INTO `empsalary` VALUES ('10', '5', '9');
INSERT INTO `empsalary` VALUES ('11', '6', '13');
INSERT INTO `empsalary` VALUES ('12', '7', '13');
INSERT INTO `empsalary` VALUES ('14', '8', '10');
INSERT INTO `empsalary` VALUES ('15', '9', '10');
INSERT INTO `empsalary` VALUES ('20', '10', '13');
INSERT INTO `empsalary` VALUES ('21', '11', '9');
INSERT INTO `empsalary` VALUES ('22', '3', '13');
INSERT INTO `empsalary` VALUES ('24', '2', '9');
INSERT INTO `empsalary` VALUES ('26', '33', '10');
INSERT INTO `empsalary` VALUES ('28', '34', '9');
INSERT INTO `empsalary` VALUES ('29', '44', '10');
INSERT INTO `empsalary` VALUES ('30', '45', '10');
INSERT INTO `empsalary` VALUES ('31', '43', '10');
INSERT INTO `empsalary` VALUES ('32', '47', '10');
INSERT INTO `empsalary` VALUES ('33', '52', '13');
INSERT INTO `empsalary` VALUES ('34', '53', '10');
INSERT INTO `empsalary` VALUES ('35', '54', '10');
INSERT INTO `empsalary` VALUES ('36', '56', '10');
INSERT INTO `empsalary` VALUES ('38', '21', '9');
INSERT INTO `empsalary` VALUES ('39', '1', '13');

-- ----------------------------
-- Table structure for flyway_schema_history
-- ----------------------------
DROP TABLE IF EXISTS `flyway_schema_history`;
CREATE TABLE `flyway_schema_history` (
  `installed_rank` int(11) NOT NULL,
  `version` varchar(50) DEFAULT NULL,
  `description` varchar(200) NOT NULL,
  `type` varchar(20) NOT NULL,
  `script` varchar(1000) NOT NULL,
  `checksum` int(11) DEFAULT NULL,
  `installed_by` varchar(100) NOT NULL,
  `installed_on` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  `execution_time` int(11) NOT NULL,
  `success` tinyint(1) NOT NULL,
  PRIMARY KEY (`installed_rank`),
  KEY `flyway_schema_history_s_idx` (`success`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;

-- ----------------------------
-- Records of flyway_schema_history
-- ----------------------------
INSERT INTO `flyway_schema_history` VALUES ('1', '1', 'vhr', 'SQL', 'V1__vhr.sql', '-1039138481', 'root', '2025-03-07 17:08:33', '5060', '1');

-- ----------------------------
-- Table structure for hr
-- ----------------------------
DROP TABLE IF EXISTS `hr`;
CREATE TABLE `hr` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'hrID',
  `name` varchar(32) DEFAULT NULL COMMENT '姓名',
  `phone` char(11) DEFAULT NULL COMMENT '手机号码',
  `telephone` varchar(16) DEFAULT NULL COMMENT '住宅电话',
  `address` varchar(64) DEFAULT NULL COMMENT '联系地址',
  `enabled` tinyint(1) DEFAULT '1',
  `username` varchar(255) DEFAULT NULL COMMENT '用户名',
  `password` varchar(255) DEFAULT NULL COMMENT '密码',
  `userface` varchar(255) DEFAULT NULL,
  `remark` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of hr
-- ----------------------------
INSERT INTO `hr` VALUES ('3', '系统管理员', '18568887789', '029-82881234', '深圳南山', '1', 'admin', '$2a$10$ySG2lkvjFHY5O0./CPIE1OI8VJsuKYEzOYzqIa7AJR6sEgSzUFOAm', 'http://bpic.588ku.com/element_pic/01/40/00/64573ce2edc0728.jpg', null);
INSERT INTO `hr` VALUES ('5', '小李', '18568123489', '029-82123434', '海口美兰', '1', 'xiaoli', '$2a$10$ySG2lkvjFHY5O0./CPIE1OI8VJsuKYEzOYzqIa7AJR6sEgSzUFOAm', 'http://101.34.137.166:8055/common/upload1/download?name=f2968402-aeba-4769-a91d-295923a89cd0e92133ff62e786385c437a7239ad5da6.jpeg', null);
INSERT INTO `hr` VALUES ('10', '韩总', '18568123666', '029-82111555', '广州番禺', '1', 'hanzong', '$2a$10$ySG2lkvjFHY5O0./CPIE1OI8VJsuKYEzOYzqIa7AJR6sEgSzUFOAm', 'http://101.34.137.166:8055/common/upload1/download?name=dacecc73-38ba-40a7-bbe6-707413d4229f694df87d30dba6850197e5517f4ba680.jpeg', null);
INSERT INTO `hr` VALUES ('11', '小柳', '18568123377', '029-82111333', '广州天河', '1', 'xiaoliu', '$2a$2a$10$ySG2lkvjFHY5O0./CPIE1OI8VJsuKYEzOYzqIa7AJR6sEgSzUFOAm', 'http://101.34.137.166:8055/common/upload1/download?name=c0d87af1-127c-4500-81c6-745b40b3b9060581ffe8a9fe92a87e3bfef5e2726298.jpeg', null);
INSERT INTO `hr` VALUES ('12', 'HR小助手(AI)', '18568128888', '029-82111222', '广州越秀', '1', 'ai', '$2a$2a$10$ySG2lkvjFHY5O0./CPIE1OI8VJsuKYEzOYzqIa7AJR6sEgSzUFOAm', 'http://101.34.137.166:8055/common/upload1/download?name=3fcf38bb-573c-40fc-8c40-d8de2fe63c0a_我的.png', null);

-- ----------------------------
-- Table structure for hr_role
-- ----------------------------
DROP TABLE IF EXISTS `hr_role`;
CREATE TABLE `hr_role` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `hrid` int(11) DEFAULT NULL,
  `rid` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `rid` (`rid`),
  KEY `hr_role_ibfk_1` (`hrid`),
  CONSTRAINT `hr_role_ibfk_1` FOREIGN KEY (`hrid`) REFERENCES `hr` (`id`) ON DELETE CASCADE,
  CONSTRAINT `hr_role_ibfk_2` FOREIGN KEY (`rid`) REFERENCES `role` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=75 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of hr_role
-- ----------------------------
INSERT INTO `hr_role` VALUES ('1', '3', '6');
INSERT INTO `hr_role` VALUES ('35', '12', '4');
INSERT INTO `hr_role` VALUES ('36', '12', '3');
INSERT INTO `hr_role` VALUES ('37', '12', '2');
INSERT INTO `hr_role` VALUES ('43', '11', '3');
INSERT INTO `hr_role` VALUES ('44', '11', '2');
INSERT INTO `hr_role` VALUES ('45', '11', '4');
INSERT INTO `hr_role` VALUES ('46', '11', '5');
INSERT INTO `hr_role` VALUES ('48', '10', '3');
INSERT INTO `hr_role` VALUES ('49', '10', '4');
INSERT INTO `hr_role` VALUES ('72', '5', '1');
INSERT INTO `hr_role` VALUES ('73', '5', '2');
INSERT INTO `hr_role` VALUES ('74', '5', '3');

-- ----------------------------
-- Table structure for joblevel
-- ----------------------------
DROP TABLE IF EXISTS `joblevel`;
CREATE TABLE `joblevel` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(32) DEFAULT NULL COMMENT '职称名称',
  `titleLevel` enum('正高级','副高级','中级','初级','员级') DEFAULT NULL,
  `createDate` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `enabled` tinyint(1) DEFAULT '1',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=18 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of joblevel
-- ----------------------------
INSERT INTO `joblevel` VALUES ('9', '教授', '正高级', '2018-01-11 00:00:00', '1');
INSERT INTO `joblevel` VALUES ('10', '副教授', '副高级', '2018-01-11 21:19:20', '1');
INSERT INTO `joblevel` VALUES ('12', '助教', '初级', '2018-01-11 21:35:39', '1');
INSERT INTO `joblevel` VALUES ('13', '讲师', '中级', '2018-01-11 00:00:00', '0');
INSERT INTO `joblevel` VALUES ('14', '初级工程师', '初级', '2018-01-14 00:00:00', '1');
INSERT INTO `joblevel` VALUES ('15', '中级工程师66', '中级', '2018-01-14 00:00:00', '1');
INSERT INTO `joblevel` VALUES ('16', '高级工程师', '副高级', '2018-01-14 16:19:14', '1');
INSERT INTO `joblevel` VALUES ('17', '骨灰级工程师', '正高级', '2018-01-14 16:19:24', '1');

-- ----------------------------
-- Table structure for mail_send_log
-- ----------------------------
DROP TABLE IF EXISTS `mail_send_log`;
CREATE TABLE `mail_send_log` (
  `msgId` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `empId` int(11) DEFAULT NULL,
  `status` int(11) DEFAULT '0' COMMENT '0发送中，1发送成功，2发送失败',
  `routeKey` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `exchange` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_general_ci DEFAULT NULL,
  `count` int(11) DEFAULT '0' COMMENT '重试次数',
  `tryTime` datetime DEFAULT NULL COMMENT '第一次重试时间',
  `createTime` datetime DEFAULT NULL,
  `updateTime` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- ----------------------------
-- Records of mail_send_log
-- ----------------------------
INSERT INTO `mail_send_log` VALUES ('8a2d639f-0544-4b84-a7b9-07d18fa55481', '1942', '2', 'javaboy.mail.routing.key', 'javaboy.mail.exchange', '3', '2025-03-19 17:19:47', '2025-03-19 17:18:47', '2025-03-20 01:20:10');
INSERT INTO `mail_send_log` VALUES ('b451269b-c1b0-49d8-b8e1-a938d279309c', '1943', '2', 'javaboy.mail.routing.key', 'javaboy.mail.exchange', '3', '2025-03-27 16:22:23', '2025-03-27 16:21:23', '2025-04-07 11:16:10');
INSERT INTO `mail_send_log` VALUES ('dd95aaca-449d-455a-8bcc-85574cf74015', '1944', '2', 'javaboy.mail.routing.key', 'javaboy.mail.exchange', '3', '2025-03-27 16:35:32', '2025-03-27 16:34:32', '2025-04-07 11:16:10');
INSERT INTO `mail_send_log` VALUES ('9c1e8798-870d-485c-99be-beae34410034', '1945', '2', 'javaboy.mail.routing.key', 'javaboy.mail.exchange', '3', '2025-03-27 16:42:44', '2025-03-27 16:41:44', '2025-04-07 11:16:10');

-- ----------------------------
-- Table structure for menu
-- ----------------------------
DROP TABLE IF EXISTS `menu`;
CREATE TABLE `menu` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `url` varchar(64) DEFAULT NULL,
  `path` varchar(64) DEFAULT NULL,
  `component` varchar(64) DEFAULT NULL,
  `name` varchar(64) DEFAULT NULL,
  `iconCls` varchar(64) DEFAULT NULL,
  `keepAlive` tinyint(1) DEFAULT NULL,
  `requireAuth` tinyint(1) DEFAULT NULL,
  `parentId` int(11) DEFAULT NULL,
  `enabled` tinyint(1) DEFAULT '1',
  PRIMARY KEY (`id`),
  KEY `parentId` (`parentId`),
  CONSTRAINT `menu_ibfk_1` FOREIGN KEY (`parentId`) REFERENCES `menu` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=30 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of menu
-- ----------------------------
INSERT INTO `menu` VALUES ('1', '/', null, null, '所有', null, null, null, null, '1');
INSERT INTO `menu` VALUES ('2', '/', '/home', 'Home', '员工资料', 'fa fa-user-circle-o', null, '1', '1', '1');
INSERT INTO `menu` VALUES ('3', '/', '/home', 'Home', '人事管理', 'fa fa-address-card-o', null, '1', '1', '1');
INSERT INTO `menu` VALUES ('4', '/', '/home', 'Home', '薪资管理', 'fa fa-money', null, '1', '1', '1');
INSERT INTO `menu` VALUES ('5', '/', '/home', 'Home', '统计管理', 'fa fa-bar-chart', null, '1', '1', '1');
INSERT INTO `menu` VALUES ('6', '/', '/home', 'Home', '系统管理', 'fa fa-windows', null, '1', '1', '1');
INSERT INTO `menu` VALUES ('7', '/employee/basic/**', '/emp/basic', 'EmpBasic', '基本资料', null, null, '1', '2', '1');
INSERT INTO `menu` VALUES ('8', '/employee/advanced/**', '/emp/adv', 'EmpAdv', '高级资料', null, null, '1', '2', '0');
INSERT INTO `menu` VALUES ('9', '/personnel/emp/**', '/per/emp', 'PerEmp', '员工资料', null, null, '1', '3', '0');
INSERT INTO `menu` VALUES ('10', '/personnel/ec/**', '/per/ec', 'PerEc', '员工奖惩', null, null, '1', '3', '1');
INSERT INTO `menu` VALUES ('11', '/personnel/train/**', '/per/train', 'PerTrain', '员工培训', null, null, '1', '3', '1');
INSERT INTO `menu` VALUES ('12', '/personnel/salary/**', '/per/salary', 'PerSalary', '员工调薪', null, null, '1', '3', '1');
INSERT INTO `menu` VALUES ('13', '/personnel/remove/**', '/per/mv', 'PerMv', '员工离职', null, null, '1', '3', '1');
INSERT INTO `menu` VALUES ('14', '/salary/sob/**', '/sal/sob', 'SalSob', '工资账套管理', null, null, '1', '4', '1');
INSERT INTO `menu` VALUES ('15', '/salary/sobcfg/**', '/sal/sobcfg', 'SalSobCfg', '员工账套设置', null, null, '1', '4', '1');
INSERT INTO `menu` VALUES ('16', '/salary/table/**', '/sal/table', 'SalTable', '工资表管理', null, null, '1', '4', '0');
INSERT INTO `menu` VALUES ('17', '/salary/month/**', '/sal/month', 'SalMonth', '月末处理', null, null, '1', '4', '0');
INSERT INTO `menu` VALUES ('19', '/statistics/all/**', '/sta/all', 'StaAll', '综合信息统计', null, null, '1', '5', '0');
INSERT INTO `menu` VALUES ('20', '/statistics/score/**', '/sta/score', 'StaScore', '员工积分统计', null, null, '1', '5', '1');
INSERT INTO `menu` VALUES ('21', '/statistics/personnel/**', '/sta/pers', 'StaPers', '人事信息统计', null, null, '1', '5', '0');
INSERT INTO `menu` VALUES ('22', '/statistics/recored/**', '/sta/record', 'StaRecord', '人事记录统计', null, null, '1', '5', '0');
INSERT INTO `menu` VALUES ('23', '/system/basic/**', '/sys/basic', 'SysBasic', '基础信息设置', null, null, '1', '6', '1');
INSERT INTO `menu` VALUES ('24', '/system/cfg/**', '/sys/cfg', 'SysCfg', '系统管理', null, null, '1', '6', '1');
INSERT INTO `menu` VALUES ('25', '/system/log/**', '/sys/log', 'SysLog', '操作日志管理', null, null, '1', '6', '1');
INSERT INTO `menu` VALUES ('26', '/system/hr/**', '/sys/hr', 'SysHr', '操作员管理', null, null, '1', '6', '1');
INSERT INTO `menu` VALUES ('29', '/sal/pay/**', '/sal/pay', 'SalPay', '工资发放', null, null, '1', '4', '1');

-- ----------------------------
-- Table structure for menu_role
-- ----------------------------
DROP TABLE IF EXISTS `menu_role`;
CREATE TABLE `menu_role` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `mid` int(11) DEFAULT NULL,
  `rid` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `mid` (`mid`),
  KEY `rid` (`rid`),
  CONSTRAINT `menu_role_ibfk_1` FOREIGN KEY (`mid`) REFERENCES `menu` (`id`),
  CONSTRAINT `menu_role_ibfk_2` FOREIGN KEY (`rid`) REFERENCES `role` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=311 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of menu_role
-- ----------------------------
INSERT INTO `menu_role` VALUES ('161', '7', '3');
INSERT INTO `menu_role` VALUES ('247', '7', '4');
INSERT INTO `menu_role` VALUES ('248', '8', '4');
INSERT INTO `menu_role` VALUES ('249', '11', '4');
INSERT INTO `menu_role` VALUES ('250', '7', '2');
INSERT INTO `menu_role` VALUES ('251', '8', '2');
INSERT INTO `menu_role` VALUES ('252', '9', '2');
INSERT INTO `menu_role` VALUES ('253', '10', '2');
INSERT INTO `menu_role` VALUES ('254', '12', '2');
INSERT INTO `menu_role` VALUES ('255', '13', '2');
INSERT INTO `menu_role` VALUES ('256', '7', '1');
INSERT INTO `menu_role` VALUES ('257', '8', '1');
INSERT INTO `menu_role` VALUES ('258', '9', '1');
INSERT INTO `menu_role` VALUES ('259', '10', '1');
INSERT INTO `menu_role` VALUES ('260', '11', '1');
INSERT INTO `menu_role` VALUES ('261', '12', '1');
INSERT INTO `menu_role` VALUES ('262', '13', '1');
INSERT INTO `menu_role` VALUES ('263', '14', '1');
INSERT INTO `menu_role` VALUES ('264', '15', '1');
INSERT INTO `menu_role` VALUES ('265', '16', '1');
INSERT INTO `menu_role` VALUES ('266', '17', '1');
INSERT INTO `menu_role` VALUES ('268', '19', '1');
INSERT INTO `menu_role` VALUES ('269', '20', '1');
INSERT INTO `menu_role` VALUES ('270', '21', '1');
INSERT INTO `menu_role` VALUES ('271', '22', '1');
INSERT INTO `menu_role` VALUES ('272', '23', '1');
INSERT INTO `menu_role` VALUES ('273', '24', '1');
INSERT INTO `menu_role` VALUES ('274', '25', '1');
INSERT INTO `menu_role` VALUES ('275', '26', '1');
INSERT INTO `menu_role` VALUES ('280', '7', '14');
INSERT INTO `menu_role` VALUES ('281', '8', '14');
INSERT INTO `menu_role` VALUES ('282', '9', '14');
INSERT INTO `menu_role` VALUES ('283', '7', '6');
INSERT INTO `menu_role` VALUES ('284', '9', '6');
INSERT INTO `menu_role` VALUES ('285', '10', '6');
INSERT INTO `menu_role` VALUES ('286', '11', '6');
INSERT INTO `menu_role` VALUES ('287', '12', '6');
INSERT INTO `menu_role` VALUES ('288', '13', '6');
INSERT INTO `menu_role` VALUES ('289', '14', '6');
INSERT INTO `menu_role` VALUES ('290', '15', '6');
INSERT INTO `menu_role` VALUES ('291', '16', '6');
INSERT INTO `menu_role` VALUES ('292', '17', '6');
INSERT INTO `menu_role` VALUES ('293', '29', '6');
INSERT INTO `menu_role` VALUES ('294', '19', '6');
INSERT INTO `menu_role` VALUES ('295', '20', '6');
INSERT INTO `menu_role` VALUES ('296', '21', '6');
INSERT INTO `menu_role` VALUES ('297', '22', '6');
INSERT INTO `menu_role` VALUES ('298', '23', '6');
INSERT INTO `menu_role` VALUES ('299', '24', '6');
INSERT INTO `menu_role` VALUES ('300', '25', '6');
INSERT INTO `menu_role` VALUES ('301', '26', '6');
INSERT INTO `menu_role` VALUES ('304', '7', '5');
INSERT INTO `menu_role` VALUES ('305', '8', '5');
INSERT INTO `menu_role` VALUES ('306', '14', '5');
INSERT INTO `menu_role` VALUES ('307', '15', '5');
INSERT INTO `menu_role` VALUES ('308', '16', '5');
INSERT INTO `menu_role` VALUES ('309', '17', '5');
INSERT INTO `menu_role` VALUES ('310', '29', '5');

-- ----------------------------
-- Table structure for msgcontent
-- ----------------------------
DROP TABLE IF EXISTS `msgcontent`;
CREATE TABLE `msgcontent` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(64) DEFAULT NULL,
  `message` varchar(255) DEFAULT NULL,
  `createDate` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=19 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of msgcontent
-- ----------------------------
INSERT INTO `msgcontent` VALUES ('14', '2222222222', '11111111111111111', '2018-02-02 20:46:19');
INSERT INTO `msgcontent` VALUES ('15', '22222222', '3333333333333333333333', '2018-02-02 21:45:57');
INSERT INTO `msgcontent` VALUES ('16', '通知标题1', '通知内容1', '2018-02-03 11:41:39');
INSERT INTO `msgcontent` VALUES ('17', '通知标题2', '通知内容2', '2018-02-03 11:52:37');
INSERT INTO `msgcontent` VALUES ('18', '通知标题3', '通知内容3', '2018-02-03 12:19:41');

-- ----------------------------
-- Table structure for nation
-- ----------------------------
DROP TABLE IF EXISTS `nation`;
CREATE TABLE `nation` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(32) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=57 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of nation
-- ----------------------------
INSERT INTO `nation` VALUES ('1', '汉族');
INSERT INTO `nation` VALUES ('2', '蒙古族');
INSERT INTO `nation` VALUES ('3', '回族');
INSERT INTO `nation` VALUES ('4', '藏族');
INSERT INTO `nation` VALUES ('5', '维吾尔族');
INSERT INTO `nation` VALUES ('6', '苗族');
INSERT INTO `nation` VALUES ('7', '彝族');
INSERT INTO `nation` VALUES ('8', '壮族');
INSERT INTO `nation` VALUES ('9', '布依族');
INSERT INTO `nation` VALUES ('10', '朝鲜族');
INSERT INTO `nation` VALUES ('11', '满族');
INSERT INTO `nation` VALUES ('12', '侗族');
INSERT INTO `nation` VALUES ('13', '瑶族');
INSERT INTO `nation` VALUES ('14', '白族');
INSERT INTO `nation` VALUES ('15', '土家族');
INSERT INTO `nation` VALUES ('16', '哈尼族');
INSERT INTO `nation` VALUES ('17', '哈萨克族');
INSERT INTO `nation` VALUES ('18', '傣族');
INSERT INTO `nation` VALUES ('19', '黎族');
INSERT INTO `nation` VALUES ('20', '傈僳族');
INSERT INTO `nation` VALUES ('21', '佤族');
INSERT INTO `nation` VALUES ('22', '畲族');
INSERT INTO `nation` VALUES ('23', '高山族');
INSERT INTO `nation` VALUES ('24', '拉祜族');
INSERT INTO `nation` VALUES ('25', '水族');
INSERT INTO `nation` VALUES ('26', '东乡族');
INSERT INTO `nation` VALUES ('27', '纳西族');
INSERT INTO `nation` VALUES ('28', '景颇族');
INSERT INTO `nation` VALUES ('29', '柯尔克孜族');
INSERT INTO `nation` VALUES ('30', '土族');
INSERT INTO `nation` VALUES ('31', '达斡尔族');
INSERT INTO `nation` VALUES ('32', '仫佬族');
INSERT INTO `nation` VALUES ('33', '羌族');
INSERT INTO `nation` VALUES ('34', '布朗族');
INSERT INTO `nation` VALUES ('35', '撒拉族');
INSERT INTO `nation` VALUES ('36', '毛难族');
INSERT INTO `nation` VALUES ('37', '仡佬族');
INSERT INTO `nation` VALUES ('38', '锡伯族');
INSERT INTO `nation` VALUES ('39', '阿昌族');
INSERT INTO `nation` VALUES ('40', '普米族');
INSERT INTO `nation` VALUES ('41', '塔吉克族');
INSERT INTO `nation` VALUES ('42', '怒族');
INSERT INTO `nation` VALUES ('43', '乌孜别克族');
INSERT INTO `nation` VALUES ('44', '俄罗斯族');
INSERT INTO `nation` VALUES ('45', '鄂温克族');
INSERT INTO `nation` VALUES ('46', '崩龙族');
INSERT INTO `nation` VALUES ('47', '保安族');
INSERT INTO `nation` VALUES ('48', '裕固族');
INSERT INTO `nation` VALUES ('49', '京族');
INSERT INTO `nation` VALUES ('50', '塔塔尔族');
INSERT INTO `nation` VALUES ('51', '独龙族');
INSERT INTO `nation` VALUES ('52', '鄂伦春族');
INSERT INTO `nation` VALUES ('53', '赫哲族');
INSERT INTO `nation` VALUES ('54', '门巴族');
INSERT INTO `nation` VALUES ('55', '珞巴族');
INSERT INTO `nation` VALUES ('56', '基诺族');

-- ----------------------------
-- Table structure for oplog
-- ----------------------------
DROP TABLE IF EXISTS `oplog`;
CREATE TABLE `oplog` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `addDate` date DEFAULT NULL COMMENT '添加日期',
  `operate` varchar(255) DEFAULT NULL COMMENT '操作内容',
  `hrid` int(11) DEFAULT NULL COMMENT '操作员ID',
  PRIMARY KEY (`id`),
  KEY `hrid` (`hrid`),
  CONSTRAINT `oplog_ibfk_1` FOREIGN KEY (`hrid`) REFERENCES `hr` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=1047 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of oplog
-- ----------------------------
INSERT INTO `oplog` VALUES ('4', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('5', '2025-03-21', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('6', '2025-03-21', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('7', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('8', '2025-03-21', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('9', '2025-03-21', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('10', '2025-03-21', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('11', '2025-03-21', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('12', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('13', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('14', '2025-03-21', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('15', '2025-03-21', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('16', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('17', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('18', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('19', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('20', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('21', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('22', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('23', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('24', '2025-03-21', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('25', '2025-03-21', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('26', '2025-03-21', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('27', '2025-03-21', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('28', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('29', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('30', '2025-03-21', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('31', '2025-03-21', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('32', '2025-03-21', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('33', '2025-03-21', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('34', '2025-03-21', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('35', '2025-03-21', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('36', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('37', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('38', '2025-03-21', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('39', '2025-03-21', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('40', '2025-03-21', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('41', '2025-03-21', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('42', '2025-03-21', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('43', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('44', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('45', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('46', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('47', '2025-03-21', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('48', '2025-03-21', '/employee/remove/', '3');
INSERT INTO `oplog` VALUES ('49', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('50', '2025-03-21', '/salary/adjust/', '3');
INSERT INTO `oplog` VALUES ('51', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('52', '2025-03-21', '/employee/train/', '3');
INSERT INTO `oplog` VALUES ('53', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('54', '2025-03-21', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('55', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('56', '2025-03-21', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('57', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('58', '2025-03-21', '/salary/sobcfg/', '3');
INSERT INTO `oplog` VALUES ('59', '2025-03-21', '/salary/sobcfg/salaries', '3');
INSERT INTO `oplog` VALUES ('60', '2025-03-21', '/salary/sob/', '3');
INSERT INTO `oplog` VALUES ('61', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('62', '2025-03-21', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('63', '2025-03-21', '/salary/sob/', '3');
INSERT INTO `oplog` VALUES ('64', '2025-03-21', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('65', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('66', '2025-03-21', '/employee/train/', '3');
INSERT INTO `oplog` VALUES ('67', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('68', '2025-03-21', '/salary/adjust/', '3');
INSERT INTO `oplog` VALUES ('69', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('70', '2025-03-21', '/employee/remove/', '3');
INSERT INTO `oplog` VALUES ('71', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('72', '2025-03-21', '/employee/train/', '3');
INSERT INTO `oplog` VALUES ('73', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('74', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('75', '2025-03-21', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('76', '2025-03-21', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('77', '2025-03-21', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('78', '2025-03-21', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('79', '2025-03-21', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('80', '2025-03-21', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('81', '2025-03-21', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('82', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('83', '2025-03-21', '/employee/train/', '3');
INSERT INTO `oplog` VALUES ('84', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('85', '2025-03-21', '/salary/adjust/', '3');
INSERT INTO `oplog` VALUES ('86', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('87', '2025-03-21', '/employee/remove/', '3');
INSERT INTO `oplog` VALUES ('88', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('89', '2025-03-21', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('90', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('91', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('92', '2025-03-21', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('93', '2025-03-21', '/salary/sob/', '3');
INSERT INTO `oplog` VALUES ('94', '2025-03-21', '/salary/sobcfg/', '3');
INSERT INTO `oplog` VALUES ('95', '2025-03-21', '/salary/sobcfg/salaries', '3');
INSERT INTO `oplog` VALUES ('96', '2025-03-21', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('97', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('98', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('99', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('100', '2025-03-21', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('101', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('102', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('103', '2025-03-21', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('104', '2025-03-21', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('105', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('106', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('107', '2025-03-21', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('108', '2025-03-21', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('109', '2025-03-21', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('110', '2025-03-21', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('111', '2025-03-21', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('112', '2025-03-21', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('113', '2025-03-21', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('114', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('115', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('116', '2025-03-21', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('117', '2025-03-21', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('118', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('119', '2025-03-21', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('120', '2025-03-21', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('121', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('122', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('123', '2025-03-21', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('124', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('125', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('126', '2025-03-21', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('127', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('128', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('129', '2025-03-21', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('130', '2025-03-21', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('131', '2025-03-21', '/salary/sobcfg/', '3');
INSERT INTO `oplog` VALUES ('132', '2025-03-21', '/salary/sobcfg/salaries', '3');
INSERT INTO `oplog` VALUES ('133', '2025-03-21', '/salary/sob/', '3');
INSERT INTO `oplog` VALUES ('134', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('135', '2025-03-21', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('136', '2025-03-21', '/employee/train/', '3');
INSERT INTO `oplog` VALUES ('137', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('138', '2025-03-21', '/salary/adjust/', '3');
INSERT INTO `oplog` VALUES ('139', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('140', '2025-03-21', '/employee/remove/', '3');
INSERT INTO `oplog` VALUES ('141', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('142', '2025-03-21', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('143', '2025-03-21', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('144', '2025-03-21', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('145', '2025-03-21', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('146', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('147', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('148', '2025-03-21', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('149', '2025-03-21', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('150', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('151', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('152', '2025-03-21', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('153', '2025-03-21', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('154', '2025-03-21', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('155', '2025-03-21', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('156', '2025-03-21', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('157', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('158', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('159', '2025-03-21', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('160', '2025-03-21', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('161', '2025-03-21', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('162', '2025-03-21', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('163', '2025-03-21', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('164', '2025-03-21', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('165', '2025-03-21', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('166', '2025-03-21', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('167', '2025-03-21', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('168', '2025-03-21', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('169', '2025-03-21', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('170', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('171', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('172', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('173', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('174', '2025-03-21', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('175', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('176', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('177', '2025-03-21', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('178', '2025-03-21', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('179', '2025-03-21', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('180', '2025-03-21', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('181', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('182', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('183', '2025-03-21', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('184', '2025-03-21', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('185', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('186', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('187', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('188', '2025-03-21', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('189', '2025-03-21', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('190', '2025-03-21', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('191', '2025-03-21', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('192', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('193', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('194', '2025-03-21', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('195', '2025-03-21', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('196', '2025-03-21', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('197', '2025-03-21', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('198', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('199', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('200', '2025-03-21', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('201', '2025-03-21', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('202', '2025-03-21', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('203', '2025-03-21', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('204', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('205', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('206', '2025-03-21', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('207', '2025-03-21', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('208', '2025-03-21', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('209', '2025-03-21', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('210', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('211', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('212', '2025-03-21', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('213', '2025-03-21', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('214', '2025-03-21', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('215', '2025-03-21', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('216', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('217', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('218', '2025-03-21', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('219', '2025-03-21', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('220', '2025-03-21', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('221', '2025-03-21', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('222', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('223', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('224', '2025-03-21', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('225', '2025-03-21', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('226', '2025-03-21', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('227', '2025-03-21', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('228', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('229', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('230', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('231', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('232', '2025-03-21', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('233', '2025-03-21', '/salary/sob/', '3');
INSERT INTO `oplog` VALUES ('234', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('235', '2025-03-21', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('236', '2025-03-21', '/salary/sobcfg/salaries', '3');
INSERT INTO `oplog` VALUES ('237', '2025-03-21', '/salary/sobcfg/', '3');
INSERT INTO `oplog` VALUES ('238', '2025-03-21', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('239', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('240', '2025-03-21', '/employee/remove/', '3');
INSERT INTO `oplog` VALUES ('241', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('242', '2025-03-21', '/employee/remove/', '3');
INSERT INTO `oplog` VALUES ('243', '2025-03-21', '/employee/remove/', '3');
INSERT INTO `oplog` VALUES ('244', '2025-03-21', '/employee/remove/', '3');
INSERT INTO `oplog` VALUES ('245', '2025-03-21', '/employee/remove/', '3');
INSERT INTO `oplog` VALUES ('246', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('247', '2025-03-21', '/employee/remove/', '3');
INSERT INTO `oplog` VALUES ('248', '2025-03-21', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('249', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('250', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('251', '2025-03-21', '/system/basic/menu/27', '3');
INSERT INTO `oplog` VALUES ('252', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('253', '2025-03-21', '/system/basic/menu/28', '3');
INSERT INTO `oplog` VALUES ('254', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('255', '2025-03-21', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('256', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('257', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('258', '2025-03-21', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('259', '2025-03-21', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('260', '2025-03-21', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('261', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('262', '2025-03-21', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('263', '2025-03-21', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('264', '2025-03-21', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('265', '2025-03-21', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('266', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('267', '2025-03-21', '/salary/sobcfg/', '3');
INSERT INTO `oplog` VALUES ('268', '2025-03-21', '/salary/sobcfg/salaries', '3');
INSERT INTO `oplog` VALUES ('269', '2025-03-21', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('270', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('271', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('272', '2025-03-21', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('273', '2025-03-21', '/salary/sobcfg/', '3');
INSERT INTO `oplog` VALUES ('274', '2025-03-21', '/salary/sobcfg/salaries', '3');
INSERT INTO `oplog` VALUES ('275', '2025-03-21', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('276', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('277', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('278', '2025-03-21', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('279', '2025-03-21', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('280', '2025-03-21', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('281', '2025-03-24', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('282', '2025-03-24', '/employee/basic/joblevels', '3');
INSERT INTO `oplog` VALUES ('283', '2025-03-24', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('284', '2025-03-24', '/employee/basic/politicsstatus', '3');
INSERT INTO `oplog` VALUES ('285', '2025-03-24', '/employee/basic/nations', '3');
INSERT INTO `oplog` VALUES ('286', '2025-03-24', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('287', '2025-03-24', '/employee/basic/deps', '3');
INSERT INTO `oplog` VALUES ('288', '2025-03-24', '/employee/train/', '3');
INSERT INTO `oplog` VALUES ('289', '2025-03-24', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('290', '2025-03-24', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('291', '2025-03-24', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('292', '2025-03-24', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('293', '2025-03-24', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('294', '2025-03-24', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('295', '2025-03-24', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('296', '2025-03-24', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('297', '2025-03-24', '/employee/train/', '3');
INSERT INTO `oplog` VALUES ('298', '2025-03-24', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('299', '2025-03-25', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('300', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('301', '2025-03-25', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('302', '2025-03-25', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('303', '2025-03-25', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('304', '2025-03-25', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('305', '2025-03-25', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('306', '2025-03-25', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('307', '2025-03-25', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('308', '2025-03-25', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('309', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('310', '2025-03-25', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('311', '2025-03-25', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('312', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('313', '2025-03-25', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('314', '2025-03-25', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('315', '2025-03-25', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('316', '2025-03-25', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('317', '2025-03-25', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('318', '2025-03-25', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('319', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('320', '2025-03-25', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('321', '2025-03-25', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('322', '2025-03-25', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('323', '2025-03-25', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('324', '2025-03-25', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('325', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('326', '2025-03-25', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('327', '2025-03-25', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('328', '2025-03-25', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('329', '2025-03-25', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('330', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('331', '2025-03-25', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('332', '2025-03-25', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('333', '2025-03-25', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('334', '2025-03-25', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('335', '2025-03-25', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('336', '2025-03-25', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('337', '2025-03-25', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('338', '2025-03-25', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('339', '2025-03-25', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('340', '2025-03-25', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('341', '2025-03-25', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('342', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('343', '2025-03-25', '/employee/remove/', '3');
INSERT INTO `oplog` VALUES ('344', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('345', '2025-03-25', '/salary/adjust/', '3');
INSERT INTO `oplog` VALUES ('346', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('347', '2025-03-25', '/employee/remove/', '3');
INSERT INTO `oplog` VALUES ('348', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('349', '2025-03-25', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('350', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('351', '2025-03-25', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('352', '2025-03-25', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('353', '2025-03-25', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('354', '2025-03-25', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('355', '2025-03-25', '/employee/remove/', '3');
INSERT INTO `oplog` VALUES ('356', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('357', '2025-03-25', '/employee/remove/', '3');
INSERT INTO `oplog` VALUES ('358', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('359', '2025-03-25', '/salary/adjust/', '3');
INSERT INTO `oplog` VALUES ('360', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('361', '2025-03-25', '/employee/remove/', '3');
INSERT INTO `oplog` VALUES ('362', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('363', '2025-03-25', '/employee/remove/', '3');
INSERT INTO `oplog` VALUES ('364', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('365', '2025-03-25', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('366', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('367', '2025-03-25', '/salary/adjust/', '3');
INSERT INTO `oplog` VALUES ('368', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('369', '2025-03-25', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('370', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('371', '2025-03-25', '/employee/remove/', '3');
INSERT INTO `oplog` VALUES ('372', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('373', '2025-03-25', '/salary/adjust/', '3');
INSERT INTO `oplog` VALUES ('374', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('375', '2025-03-25', '/employee/train/', '3');
INSERT INTO `oplog` VALUES ('376', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('377', '2025-03-25', '/employee/basic/nations', '3');
INSERT INTO `oplog` VALUES ('378', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('379', '2025-03-25', '/employee/basic/politicsstatus', '3');
INSERT INTO `oplog` VALUES ('380', '2025-03-25', '/employee/basic/joblevels', '3');
INSERT INTO `oplog` VALUES ('381', '2025-03-25', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('382', '2025-03-25', '/employee/basic/deps', '3');
INSERT INTO `oplog` VALUES ('383', '2025-03-25', '/salary/sobcfg/', '3');
INSERT INTO `oplog` VALUES ('384', '2025-03-25', '/salary/sobcfg/salaries', '3');
INSERT INTO `oplog` VALUES ('385', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('386', '2025-03-25', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('387', '2025-03-25', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('388', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('389', '2025-03-25', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('390', '2025-03-25', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('391', '2025-03-25', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('392', '2025-03-25', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('393', '2025-03-25', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('394', '2025-03-25', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('395', '2025-03-25', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('396', '2025-03-25', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('397', '2025-03-25', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('398', '2025-03-25', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('399', '2025-03-25', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('400', '2025-03-25', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('401', '2025-03-25', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('402', '2025-03-25', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('403', '2025-03-25', '/chat/hrs', '3');
INSERT INTO `oplog` VALUES ('404', '2025-03-25', '/system/config/menu', '5');
INSERT INTO `oplog` VALUES ('405', '2025-03-25', '/chat/hrs', '5');
INSERT INTO `oplog` VALUES ('406', '2025-03-25', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('407', '2025-03-25', '/salary/sob/', '3');
INSERT INTO `oplog` VALUES ('408', '2025-03-25', '/system/config/menu', '5');
INSERT INTO `oplog` VALUES ('409', '2025-03-25', '/salary/sob/', '5');
INSERT INTO `oplog` VALUES ('410', '2025-03-25', '/chat/hrs', '5');
INSERT INTO `oplog` VALUES ('411', '2025-03-25', '/system/config/menu', '5');
INSERT INTO `oplog` VALUES ('412', '2025-03-25', '/chat/hrs', '5');
INSERT INTO `oplog` VALUES ('413', '2025-03-25', '/employee/basic/nations', '5');
INSERT INTO `oplog` VALUES ('414', '2025-03-25', '/employee/basic/politicsstatus', '5');
INSERT INTO `oplog` VALUES ('415', '2025-03-25', '/employee/basic/positions', '5');
INSERT INTO `oplog` VALUES ('416', '2025-03-25', '/employee/basic/joblevels', '5');
INSERT INTO `oplog` VALUES ('417', '2025-03-25', '/employee/basic/', '5');
INSERT INTO `oplog` VALUES ('418', '2025-03-25', '/employee/basic/deps', '5');
INSERT INTO `oplog` VALUES ('419', '2025-03-25', '/system/basic/menu/', '5');
INSERT INTO `oplog` VALUES ('420', '2025-03-25', '/system/basic/menu/getByParentId', '5');
INSERT INTO `oplog` VALUES ('421', '2025-03-25', '/system/basic/menu/', '5');
INSERT INTO `oplog` VALUES ('422', '2025-03-25', '/system/basic/menu/', '5');
INSERT INTO `oplog` VALUES ('423', '2025-03-25', '/system/config/menu', '5');
INSERT INTO `oplog` VALUES ('424', '2025-03-25', '/employee/basic/positions', '5');
INSERT INTO `oplog` VALUES ('425', '2025-03-25', '/employee/basic/', '5');
INSERT INTO `oplog` VALUES ('426', '2025-03-25', '/employee/ec/', '5');
INSERT INTO `oplog` VALUES ('427', '2025-03-25', '/employee/basic/', '5');
INSERT INTO `oplog` VALUES ('428', '2025-03-25', '/employee/train/', '5');
INSERT INTO `oplog` VALUES ('429', '2025-03-25', '/employee/basic/', '5');
INSERT INTO `oplog` VALUES ('430', '2025-03-25', '/salary/adjust/', '5');
INSERT INTO `oplog` VALUES ('431', '2025-03-25', '/employee/basic/', '5');
INSERT INTO `oplog` VALUES ('432', '2025-03-25', '/employee/remove/', '5');
INSERT INTO `oplog` VALUES ('433', '2025-03-25', '/employee/basic/', '5');
INSERT INTO `oplog` VALUES ('434', '2025-03-25', '/salary/sob/', '5');
INSERT INTO `oplog` VALUES ('435', '2025-03-25', '/salary/sobcfg/salaries', '5');
INSERT INTO `oplog` VALUES ('436', '2025-03-25', '/salary/sobcfg/', '5');
INSERT INTO `oplog` VALUES ('437', '2025-03-25', '/employee/basic/', '5');
INSERT INTO `oplog` VALUES ('438', '2025-03-25', '/employee/basic/positions', '5');
INSERT INTO `oplog` VALUES ('439', '2025-03-25', '/employee/ec/', '5');
INSERT INTO `oplog` VALUES ('440', '2025-03-25', '/employee/basic/', '5');
INSERT INTO `oplog` VALUES ('441', '2025-03-25', '/salary/sob/', '5');
INSERT INTO `oplog` VALUES ('442', '2025-03-25', '/salary/sobcfg/salaries', '5');
INSERT INTO `oplog` VALUES ('443', '2025-03-25', '/salary/sobcfg/', '5');
INSERT INTO `oplog` VALUES ('444', '2025-03-25', '/salary/sob/', '5');
INSERT INTO `oplog` VALUES ('445', '2025-03-25', '/salary/sobcfg/salaries', '5');
INSERT INTO `oplog` VALUES ('446', '2025-03-25', '/salary/sobcfg/', '5');
INSERT INTO `oplog` VALUES ('447', '2025-03-25', '/salary/sob/', '5');
INSERT INTO `oplog` VALUES ('448', '2025-03-25', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('449', '2025-03-25', '/chat/hrs', '3');
INSERT INTO `oplog` VALUES ('450', '2025-03-25', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('451', '2025-03-25', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('452', '2025-03-25', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('453', '2025-03-25', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('454', '2025-03-25', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('455', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('456', '2025-03-25', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('457', '2025-03-25', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('458', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('459', '2025-03-25', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('460', '2025-03-25', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('461', '2025-03-25', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('462', '2025-03-25', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('463', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('464', '2025-03-25', '/employee/basic/nations', '3');
INSERT INTO `oplog` VALUES ('465', '2025-03-25', '/employee/basic/politicsstatus', '3');
INSERT INTO `oplog` VALUES ('466', '2025-03-25', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('467', '2025-03-25', '/employee/basic/joblevels', '3');
INSERT INTO `oplog` VALUES ('468', '2025-03-25', '/employee/basic/deps', '3');
INSERT INTO `oplog` VALUES ('469', '2025-03-25', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('470', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('471', '2025-03-25', '/salary/sob/', '3');
INSERT INTO `oplog` VALUES ('472', '2025-03-25', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('473', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('474', '2025-03-25', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('475', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('476', '2025-03-25', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('477', '2025-03-25', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('478', '2025-03-25', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('479', '2025-03-25', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('480', '2025-03-25', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('481', '2025-03-25', '/employee/train/', '3');
INSERT INTO `oplog` VALUES ('482', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('483', '2025-03-25', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('484', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('485', '2025-03-25', '/employee/train/', '3');
INSERT INTO `oplog` VALUES ('486', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('487', '2025-03-25', '/salary/adjust/', '3');
INSERT INTO `oplog` VALUES ('488', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('489', '2025-03-25', '/employee/remove/', '3');
INSERT INTO `oplog` VALUES ('490', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('491', '2025-03-25', '/chat/hrs', '3');
INSERT INTO `oplog` VALUES ('492', '2025-03-25', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('493', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('494', '2025-03-25', '/salary/sobcfg/', '3');
INSERT INTO `oplog` VALUES ('495', '2025-03-25', '/salary/sobcfg/salaries', '3');
INSERT INTO `oplog` VALUES ('496', '2025-03-25', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('497', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('498', '2025-03-25', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('499', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('500', '2025-03-25', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('501', '2025-03-25', '/system/basic/department/', '5');
INSERT INTO `oplog` VALUES ('502', '2025-03-25', '/system/basic/pos/', '5');
INSERT INTO `oplog` VALUES ('503', '2025-03-25', '/system/basic/permiss/', '5');
INSERT INTO `oplog` VALUES ('504', '2025-03-25', '/system/basic/joblevel/', '5');
INSERT INTO `oplog` VALUES ('505', '2025-03-25', '/employee/basic/positions', '5');
INSERT INTO `oplog` VALUES ('506', '2025-03-25', '/employee/basic/', '5');
INSERT INTO `oplog` VALUES ('507', '2025-03-25', '/employee/basic/', '5');
INSERT INTO `oplog` VALUES ('508', '2025-03-25', '/employee/basic/', '5');
INSERT INTO `oplog` VALUES ('509', '2025-03-25', '/employee/basic/', '5');
INSERT INTO `oplog` VALUES ('510', '2025-03-25', '/employee/basic/', '5');
INSERT INTO `oplog` VALUES ('511', '2025-03-25', '/employee/basic/', '5');
INSERT INTO `oplog` VALUES ('512', '2025-03-25', '/employee/basic/', '5');
INSERT INTO `oplog` VALUES ('513', '2025-03-25', '/employee/basic/', '5');
INSERT INTO `oplog` VALUES ('514', '2025-03-25', '/employee/basic/', '5');
INSERT INTO `oplog` VALUES ('515', '2025-03-25', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('516', '2025-03-25', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('517', '2025-03-25', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('518', '2025-03-25', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('519', '2025-03-25', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('520', '2025-03-25', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('521', '2025-03-25', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('522', '2025-03-25', '/salary/sob/', '3');
INSERT INTO `oplog` VALUES ('523', '2025-03-25', '/salary/sobcfg/salaries', '3');
INSERT INTO `oplog` VALUES ('524', '2025-03-25', '/salary/sobcfg/', '3');
INSERT INTO `oplog` VALUES ('525', '2025-03-25', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('526', '2025-03-25', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('527', '2025-03-25', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('528', '2025-03-25', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('529', '2025-03-25', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('530', '2025-03-25', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('531', '2025-03-25', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('532', '2025-03-25', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('533', '2025-03-25', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('534', '2025-03-25', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('535', '2025-03-25', '/system/hr/roles', '3');
INSERT INTO `oplog` VALUES ('536', '2025-03-25', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('537', '2025-03-25', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('538', '2025-03-25', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('539', '2025-03-25', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('540', '2025-03-25', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('541', '2025-03-25', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('542', '2025-03-25', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('543', '2025-03-25', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('544', '2025-03-25', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('545', '2025-03-25', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('546', '2025-03-25', '/chat/hrs', '3');
INSERT INTO `oplog` VALUES ('547', '2025-03-25', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('548', '2025-03-25', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('549', '2025-03-25', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('550', '2025-03-25', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('551', '2025-03-25', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('552', '2025-03-25', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('553', '2025-03-25', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('554', '2025-03-25', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('555', '2025-03-25', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('556', '2025-03-25', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('557', '2025-03-25', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('558', '2025-03-25', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('559', '2025-03-26', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('560', '2025-03-26', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('561', '2025-03-26', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('562', '2025-03-26', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('563', '2025-03-26', '/system/basic/permiss/menus', '3');
INSERT INTO `oplog` VALUES ('564', '2025-03-26', '/system/basic/permiss/menus', '3');
INSERT INTO `oplog` VALUES ('565', '2025-03-26', '/system/basic/permiss/mids/2', '3');
INSERT INTO `oplog` VALUES ('566', '2025-03-26', '/system/basic/permiss/mids/1', '3');
INSERT INTO `oplog` VALUES ('567', '2025-03-26', '/system/basic/permiss/menus', '3');
INSERT INTO `oplog` VALUES ('568', '2025-03-26', '/system/basic/permiss/mids/3', '3');
INSERT INTO `oplog` VALUES ('569', '2025-03-26', '/system/basic/permiss/menus', '3');
INSERT INTO `oplog` VALUES ('570', '2025-03-26', '/system/basic/permiss/mids/4', '3');
INSERT INTO `oplog` VALUES ('571', '2025-03-26', '/system/basic/permiss/menus', '3');
INSERT INTO `oplog` VALUES ('572', '2025-03-26', '/system/basic/permiss/mids/5', '3');
INSERT INTO `oplog` VALUES ('573', '2025-03-26', '/system/basic/permiss/menus', '3');
INSERT INTO `oplog` VALUES ('574', '2025-03-26', '/system/basic/permiss/mids/6', '3');
INSERT INTO `oplog` VALUES ('575', '2025-03-26', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('576', '2025-03-26', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('577', '2025-03-26', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('578', '2025-03-26', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('579', '2025-03-26', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('580', '2025-03-26', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('581', '2025-03-26', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('582', '2025-03-26', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('583', '2025-03-26', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('584', '2025-03-26', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('585', '2025-03-26', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('586', '2025-03-26', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('587', '2025-03-26', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('588', '2025-03-26', '/system/hr/roles', '3');
INSERT INTO `oplog` VALUES ('589', '2025-03-26', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('590', '2025-03-26', '/system/hr/roles', '3');
INSERT INTO `oplog` VALUES ('591', '2025-03-26', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('592', '2025-03-26', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('593', '2025-03-26', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('594', '2025-03-26', '/system/hr/roles', '3');
INSERT INTO `oplog` VALUES ('595', '2025-03-26', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('596', '2025-03-26', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('597', '2025-03-26', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('598', '2025-03-26', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('599', '2025-03-26', '/system/hr/roles', '3');
INSERT INTO `oplog` VALUES ('600', '2025-03-26', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('601', '2025-03-26', '/system/hr/13', '3');
INSERT INTO `oplog` VALUES ('602', '2025-03-26', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('603', '2025-03-26', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('604', '2025-03-26', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('605', '2025-03-26', '/system/hr/roles', '3');
INSERT INTO `oplog` VALUES ('606', '2025-03-26', '/system/hr/roles', '3');
INSERT INTO `oplog` VALUES ('607', '2025-03-27', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('608', '2025-03-27', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('609', '2025-03-27', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('610', '2025-03-27', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('611', '2025-03-27', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('612', '2025-03-27', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('613', '2025-03-27', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('614', '2025-03-27', '/chat/hrs', '3');
INSERT INTO `oplog` VALUES ('615', '2025-03-27', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('616', '2025-03-27', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('617', '2025-03-27', '/chat/hrs', '3');
INSERT INTO `oplog` VALUES ('618', '2025-03-27', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('619', '2025-03-27', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('620', '2025-03-27', '/employee/train/', '3');
INSERT INTO `oplog` VALUES ('621', '2025-03-27', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('622', '2025-03-27', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('623', '2025-03-27', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('624', '2025-03-27', '/salary/adjust/', '3');
INSERT INTO `oplog` VALUES ('625', '2025-03-27', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('626', '2025-03-27', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('627', '2025-03-27', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('628', '2025-03-27', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('629', '2025-03-27', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('630', '2025-03-27', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('631', '2025-03-27', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('632', '2025-03-27', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('633', '2025-03-27', '/employee/train/', '3');
INSERT INTO `oplog` VALUES ('634', '2025-03-27', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('635', '2025-03-27', '/salary/sob/', '3');
INSERT INTO `oplog` VALUES ('636', '2025-03-27', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('637', '2025-03-27', '/salary/sob/', '3');
INSERT INTO `oplog` VALUES ('638', '2025-03-27', '/salary/sobcfg/salaries', '3');
INSERT INTO `oplog` VALUES ('639', '2025-03-27', '/salary/sobcfg/', '3');
INSERT INTO `oplog` VALUES ('640', '2025-03-27', '/salary/sob/', '3');
INSERT INTO `oplog` VALUES ('641', '2025-03-27', '/salary/sobcfg/salaries', '3');
INSERT INTO `oplog` VALUES ('642', '2025-03-27', '/salary/sobcfg/', '3');
INSERT INTO `oplog` VALUES ('643', '2025-03-27', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('644', '2025-03-27', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('645', '2025-03-27', '/employee/basic/joblevels', '3');
INSERT INTO `oplog` VALUES ('646', '2025-03-27', '/employee/basic/nations', '3');
INSERT INTO `oplog` VALUES ('647', '2025-03-27', '/employee/basic/politicsstatus', '3');
INSERT INTO `oplog` VALUES ('648', '2025-03-27', '/employee/basic/deps', '3');
INSERT INTO `oplog` VALUES ('649', '2025-03-27', '/employee/basic/maxWorkID', '3');
INSERT INTO `oplog` VALUES ('650', '2025-03-27', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('651', '2025-03-27', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('652', '2025-03-27', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('653', '2025-03-27', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('654', '2025-03-27', '/employee/basic/maxWorkID', '3');
INSERT INTO `oplog` VALUES ('655', '2025-03-27', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('656', '2025-03-27', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('657', '2025-03-27', '/employee/basic/maxWorkID', '3');
INSERT INTO `oplog` VALUES ('658', '2025-03-27', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('659', '2025-03-27', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('660', '2025-03-27', '/employee/basic/maxWorkID', '3');
INSERT INTO `oplog` VALUES ('661', '2025-03-27', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('662', '2025-03-27', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('663', '2025-04-07', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('664', '2025-04-07', '/employee/basic/nations', '3');
INSERT INTO `oplog` VALUES ('665', '2025-04-07', '/employee/basic/joblevels', '3');
INSERT INTO `oplog` VALUES ('666', '2025-04-07', '/employee/basic/politicsstatus', '3');
INSERT INTO `oplog` VALUES ('667', '2025-04-07', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('668', '2025-04-07', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('669', '2025-04-07', '/employee/basic/deps', '3');
INSERT INTO `oplog` VALUES ('670', '2025-04-07', '/system/hr/roles', '3');
INSERT INTO `oplog` VALUES ('671', '2025-04-07', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('672', '2025-04-07', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('673', '2025-04-07', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('674', '2025-04-07', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('675', '2025-04-07', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('676', '2025-04-07', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('677', '2025-04-07', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('678', '2025-04-07', '/system/basic/permiss/menus', '3');
INSERT INTO `oplog` VALUES ('679', '2025-04-07', '/system/basic/permiss/mids/1', '3');
INSERT INTO `oplog` VALUES ('680', '2025-04-07', '/system/basic/permiss/menus', '3');
INSERT INTO `oplog` VALUES ('681', '2025-04-07', '/system/basic/permiss/mids/2', '3');
INSERT INTO `oplog` VALUES ('682', '2025-04-07', '/system/basic/permiss/menus', '3');
INSERT INTO `oplog` VALUES ('683', '2025-04-07', '/system/basic/permiss/mids/3', '3');
INSERT INTO `oplog` VALUES ('684', '2025-04-07', '/system/basic/permiss/mids/1', '3');
INSERT INTO `oplog` VALUES ('685', '2025-04-07', '/system/basic/permiss/menus', '3');
INSERT INTO `oplog` VALUES ('686', '2025-04-07', '/system/basic/permiss/menus', '3');
INSERT INTO `oplog` VALUES ('687', '2025-04-07', '/system/basic/permiss/mids/2', '3');
INSERT INTO `oplog` VALUES ('688', '2025-04-07', '/system/basic/permiss/mids/3', '3');
INSERT INTO `oplog` VALUES ('689', '2025-04-07', '/system/basic/permiss/menus', '3');
INSERT INTO `oplog` VALUES ('690', '2025-04-07', '/system/basic/permiss/menus', '3');
INSERT INTO `oplog` VALUES ('691', '2025-04-07', '/system/basic/permiss/mids/4', '3');
INSERT INTO `oplog` VALUES ('692', '2025-04-07', '/system/basic/permiss/mids/5', '3');
INSERT INTO `oplog` VALUES ('693', '2025-04-07', '/system/basic/permiss/menus', '3');
INSERT INTO `oplog` VALUES ('694', '2025-04-07', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('695', '2025-04-07', '/system/basic/permiss/mids/5', '3');
INSERT INTO `oplog` VALUES ('696', '2025-04-07', '/system/basic/permiss/menus', '3');
INSERT INTO `oplog` VALUES ('697', '2025-04-07', '/system/basic/permiss/menus', '3');
INSERT INTO `oplog` VALUES ('698', '2025-04-07', '/system/basic/permiss/mids/6', '3');
INSERT INTO `oplog` VALUES ('699', '2025-04-07', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('700', '2025-04-07', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('701', '2025-04-07', '/salary/sob/', '3');
INSERT INTO `oplog` VALUES ('702', '2025-04-07', '/salary/sobcfg/salaries', '3');
INSERT INTO `oplog` VALUES ('703', '2025-04-07', '/salary/sobcfg/', '3');
INSERT INTO `oplog` VALUES ('704', '2025-04-07', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('705', '2025-04-07', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('706', '2025-04-07', '/salary/sobcfg/salaries', '3');
INSERT INTO `oplog` VALUES ('707', '2025-04-07', '/salary/sobcfg/', '3');
INSERT INTO `oplog` VALUES ('708', '2025-04-07', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('709', '2025-04-07', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('710', '2025-04-07', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('711', '2025-04-07', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('712', '2025-04-07', '/employee/train/', '3');
INSERT INTO `oplog` VALUES ('713', '2025-04-07', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('714', '2025-04-07', '/salary/adjust/', '3');
INSERT INTO `oplog` VALUES ('715', '2025-04-07', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('716', '2025-04-07', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('717', '2025-04-07', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('718', '2025-04-07', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('719', '2025-04-07', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('720', '2025-04-07', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('721', '2025-04-07', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('722', '2025-04-07', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('723', '2025-04-07', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('724', '2025-04-07', '/chat/hrs', '3');
INSERT INTO `oplog` VALUES ('725', '2025-04-07', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('726', '2025-04-07', '/system/hr/roles', '3');
INSERT INTO `oplog` VALUES ('727', '2025-04-07', '/system/hr/roles', '3');
INSERT INTO `oplog` VALUES ('728', '2025-04-07', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('729', '2025-04-07', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('730', '2025-04-07', '/chat/hrs', '3');
INSERT INTO `oplog` VALUES ('731', '2025-04-07', '/system/hr/roles', '3');
INSERT INTO `oplog` VALUES ('732', '2025-04-07', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('733', '2025-04-07', '/chat/hrs', '3');
INSERT INTO `oplog` VALUES ('734', '2025-04-07', '/chat/hrs', '3');
INSERT INTO `oplog` VALUES ('735', '2025-04-07', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('736', '2025-04-07', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('737', '2025-04-07', '/system/hr/roles', '3');
INSERT INTO `oplog` VALUES ('738', '2025-04-07', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('739', '2025-04-08', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('740', '2025-04-08', '/employee/basic/nations', '3');
INSERT INTO `oplog` VALUES ('741', '2025-04-08', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('742', '2025-04-08', '/employee/basic/politicsstatus', '3');
INSERT INTO `oplog` VALUES ('743', '2025-04-08', '/employee/basic/joblevels', '3');
INSERT INTO `oplog` VALUES ('744', '2025-04-08', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('745', '2025-04-08', '/employee/basic/deps', '3');
INSERT INTO `oplog` VALUES ('746', '2025-04-08', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('747', '2025-04-08', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('748', '2025-04-08', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('749', '2025-04-08', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('750', '2025-04-08', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('751', '2025-04-08', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('752', '2025-04-08', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('753', '2025-04-08', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('754', '2025-04-08', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('755', '2025-04-08', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('756', '2025-04-08', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('757', '2025-04-08', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('758', '2025-04-08', '/employee/train/', '3');
INSERT INTO `oplog` VALUES ('759', '2025-04-08', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('760', '2025-04-08', '/salary/adjust/', '3');
INSERT INTO `oplog` VALUES ('761', '2025-04-08', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('762', '2025-04-08', '/employee/remove/', '3');
INSERT INTO `oplog` VALUES ('763', '2025-04-08', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('764', '2025-04-08', '/salary/sob/', '3');
INSERT INTO `oplog` VALUES ('765', '2025-04-08', '/salary/sobcfg/', '3');
INSERT INTO `oplog` VALUES ('766', '2025-04-08', '/salary/sobcfg/salaries', '3');
INSERT INTO `oplog` VALUES ('767', '2025-04-08', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('768', '2025-04-08', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('769', '2025-04-08', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('770', '2025-04-08', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('771', '2025-04-08', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('772', '2025-04-08', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('773', '2025-04-08', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('774', '2025-04-08', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('775', '2025-04-08', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('776', '2025-04-08', '/system/basic/permiss/mids/1', '3');
INSERT INTO `oplog` VALUES ('777', '2025-04-08', '/system/basic/permiss/menus', '3');
INSERT INTO `oplog` VALUES ('778', '2025-04-08', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('779', '2025-04-08', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('780', '2025-04-08', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('781', '2025-04-08', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('782', '2025-04-08', '/system/hr/roles', '3');
INSERT INTO `oplog` VALUES ('783', '2025-04-08', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('784', '2025-04-08', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('785', '2025-04-08', '/salary/sob/', '3');
INSERT INTO `oplog` VALUES ('786', '2025-04-08', '/salary/sobcfg/salaries', '3');
INSERT INTO `oplog` VALUES ('787', '2025-04-08', '/salary/sobcfg/', '3');
INSERT INTO `oplog` VALUES ('788', '2025-04-08', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('789', '2025-04-08', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('790', '2025-04-08', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('791', '2025-04-08', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('792', '2025-04-08', '/employee/train/', '3');
INSERT INTO `oplog` VALUES ('793', '2025-04-08', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('794', '2025-04-08', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('795', '2025-04-08', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('796', '2025-04-08', '/employee/train/', '3');
INSERT INTO `oplog` VALUES ('797', '2025-04-08', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('798', '2025-04-08', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('799', '2025-04-08', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('800', '2025-04-08', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('801', '2025-04-08', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('802', '2025-04-08', '/system/hr/roles', '3');
INSERT INTO `oplog` VALUES ('803', '2025-04-08', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('804', '2025-04-08', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('805', '2025-04-08', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('806', '2025-04-08', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('807', '2025-04-08', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('808', '2025-04-08', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('809', '2025-04-08', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('810', '2025-04-08', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('811', '2025-04-08', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('812', '2025-04-08', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('813', '2025-04-08', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('814', '2025-04-08', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('815', '2025-04-08', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('816', '2025-04-08', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('817', '2025-04-08', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('818', '2025-04-08', '/system/hr/roles', '3');
INSERT INTO `oplog` VALUES ('819', '2025-04-08', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('820', '2025-04-08', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('821', '2025-04-08', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('822', '2025-04-08', '/chat/hrs', '3');
INSERT INTO `oplog` VALUES ('823', '2025-04-08', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('824', '2025-04-08', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('825', '2025-04-08', '/salary/sobcfg/', '3');
INSERT INTO `oplog` VALUES ('826', '2025-04-08', '/salary/sobcfg/salaries', '3');
INSERT INTO `oplog` VALUES ('827', '2025-04-14', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('828', '2025-04-14', '/employee/basic/joblevels', '3');
INSERT INTO `oplog` VALUES ('829', '2025-04-14', '/employee/basic/politicsstatus', '3');
INSERT INTO `oplog` VALUES ('830', '2025-04-14', '/employee/basic/nations', '3');
INSERT INTO `oplog` VALUES ('831', '2025-04-14', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('832', '2025-04-14', '/employee/basic/deps', '3');
INSERT INTO `oplog` VALUES ('833', '2025-04-14', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('834', '2025-04-14', '/employee/basic/export', '3');
INSERT INTO `oplog` VALUES ('835', '2025-04-14', '/salary/sob/', '3');
INSERT INTO `oplog` VALUES ('836', '2025-04-14', '/salary/sobcfg/', '3');
INSERT INTO `oplog` VALUES ('837', '2025-04-14', '/salary/sobcfg/salaries', '3');
INSERT INTO `oplog` VALUES ('838', '2025-04-14', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('839', '2025-04-14', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('840', '2025-04-14', '/employee/basic/exportSalary', '3');
INSERT INTO `oplog` VALUES ('841', '2025-04-14', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('842', '2025-04-14', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('843', '2025-04-14', '/employee/basic/import', '3');
INSERT INTO `oplog` VALUES ('844', '2025-04-14', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('845', '2025-04-14', '/chat/hrs', '3');
INSERT INTO `oplog` VALUES ('846', '2025-04-14', '/system/config/menu', '5');
INSERT INTO `oplog` VALUES ('847', '2025-04-14', '/chat/hrs', '5');
INSERT INTO `oplog` VALUES ('848', '2025-05-12', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('849', '2025-05-12', '/employee/basic/politicsstatus', '3');
INSERT INTO `oplog` VALUES ('850', '2025-05-12', '/employee/basic/nations', '3');
INSERT INTO `oplog` VALUES ('851', '2025-05-12', '/employee/basic/joblevels', '3');
INSERT INTO `oplog` VALUES ('852', '2025-05-12', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('853', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('854', '2025-05-12', '/employee/basic/deps', '3');
INSERT INTO `oplog` VALUES ('855', '2025-05-12', '/employee/train/', '3');
INSERT INTO `oplog` VALUES ('856', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('857', '2025-05-12', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('858', '2025-05-12', '/salary/adjust/', '3');
INSERT INTO `oplog` VALUES ('859', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('860', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('861', '2025-05-12', '/salary/sob/', '3');
INSERT INTO `oplog` VALUES ('862', '2025-05-12', '/salary/sobcfg/', '3');
INSERT INTO `oplog` VALUES ('863', '2025-05-12', '/salary/sobcfg/salaries', '3');
INSERT INTO `oplog` VALUES ('864', '2025-05-12', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('865', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('866', '2025-05-12', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('867', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('868', '2025-05-12', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('869', '2025-05-12', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('870', '2025-05-12', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('871', '2025-05-12', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('872', '2025-05-12', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('873', '2025-05-12', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('874', '2025-05-12', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('875', '2025-05-12', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('876', '2025-05-12', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('877', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('878', '2025-05-12', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('879', '2025-05-12', '/employee/basic/politicsstatus', '3');
INSERT INTO `oplog` VALUES ('880', '2025-05-12', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('881', '2025-05-12', '/employee/basic/nations', '3');
INSERT INTO `oplog` VALUES ('882', '2025-05-12', '/employee/basic/joblevels', '3');
INSERT INTO `oplog` VALUES ('883', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('884', '2025-05-12', '/employee/basic/deps', '3');
INSERT INTO `oplog` VALUES ('885', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('886', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('887', '2025-05-12', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('888', '2025-05-12', '/employee/basic/export', '3');
INSERT INTO `oplog` VALUES ('889', '2025-05-12', '/employee/basic/maxWorkID', '3');
INSERT INTO `oplog` VALUES ('890', '2025-05-12', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('891', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('892', '2025-05-12', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('893', '2025-05-12', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('894', '2025-05-12', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('895', '2025-05-12', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('896', '2025-05-12', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('897', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('898', '2025-05-12', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('899', '2025-05-12', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('900', '2025-05-12', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('901', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('902', '2025-05-12', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('903', '2025-05-12', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('904', '2025-05-12', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('905', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('906', '2025-05-12', '/employee/ec/getEmployeeecMonthInfo', '3');
INSERT INTO `oplog` VALUES ('907', '2025-05-12', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('908', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('909', '2025-05-12', '/employee/train/', '3');
INSERT INTO `oplog` VALUES ('910', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('911', '2025-05-12', '/salary/adjust/', '3');
INSERT INTO `oplog` VALUES ('912', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('913', '2025-05-12', '/salary/sob/employee', '3');
INSERT INTO `oplog` VALUES ('914', '2025-05-12', '/salary/sob/employee', '3');
INSERT INTO `oplog` VALUES ('915', '2025-05-12', '/salary/adjust/', '3');
INSERT INTO `oplog` VALUES ('916', '2025-05-12', '/salary/adjust/', '3');
INSERT INTO `oplog` VALUES ('917', '2025-05-12', '/salary/sob/', '3');
INSERT INTO `oplog` VALUES ('918', '2025-05-12', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('919', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('920', '2025-05-12', '/employee/train/', '3');
INSERT INTO `oplog` VALUES ('921', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('922', '2025-05-12', '/salary/adjust/', '3');
INSERT INTO `oplog` VALUES ('923', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('924', '2025-05-12', '/employee/remove/', '3');
INSERT INTO `oplog` VALUES ('925', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('926', '2025-05-12', '/salary/adjust/', '3');
INSERT INTO `oplog` VALUES ('927', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('928', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('929', '2025-05-12', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('930', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('931', '2025-05-12', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('932', '2025-05-12', '/salary/sobcfg/salaries', '3');
INSERT INTO `oplog` VALUES ('933', '2025-05-12', '/salary/sobcfg/', '3');
INSERT INTO `oplog` VALUES ('934', '2025-05-12', '/salary/sob/', '3');
INSERT INTO `oplog` VALUES ('935', '2025-05-12', '/salary/sobcfg/', '3');
INSERT INTO `oplog` VALUES ('936', '2025-05-12', '/salary/sobcfg/salaries', '3');
INSERT INTO `oplog` VALUES ('937', '2025-05-12', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('938', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('939', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('940', '2025-05-12', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('941', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('942', '2025-05-12', '/employee/train/', '3');
INSERT INTO `oplog` VALUES ('943', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('944', '2025-05-12', '/employee/train/', '3');
INSERT INTO `oplog` VALUES ('945', '2025-05-12', '/employee/train/', '3');
INSERT INTO `oplog` VALUES ('946', '2025-05-12', '/salary/adjust/', '3');
INSERT INTO `oplog` VALUES ('947', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('948', '2025-05-12', '/employee/remove/', '3');
INSERT INTO `oplog` VALUES ('949', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('950', '2025-05-12', '/employee/train/', '3');
INSERT INTO `oplog` VALUES ('951', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('952', '2025-05-12', '/employee/remove/', '3');
INSERT INTO `oplog` VALUES ('953', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('954', '2025-05-12', '/employee/remove/', '3');
INSERT INTO `oplog` VALUES ('955', '2025-05-12', '/employee/remove/', '3');
INSERT INTO `oplog` VALUES ('956', '2025-05-12', '/employee/remove/', '3');
INSERT INTO `oplog` VALUES ('957', '2025-05-12', '/salary/sob/', '3');
INSERT INTO `oplog` VALUES ('958', '2025-05-12', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('959', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('960', '2025-05-12', '/employee/basic/maxWorkID', '3');
INSERT INTO `oplog` VALUES ('961', '2025-05-12', '/salary/sob/', '3');
INSERT INTO `oplog` VALUES ('962', '2025-05-12', '/salary/sobcfg/', '3');
INSERT INTO `oplog` VALUES ('963', '2025-05-12', '/salary/sobcfg/salaries', '3');
INSERT INTO `oplog` VALUES ('964', '2025-05-12', '/salary/sob/', '3');
INSERT INTO `oplog` VALUES ('965', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('966', '2025-05-12', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('967', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('968', '2025-05-12', '/salary/sobcfg/', '3');
INSERT INTO `oplog` VALUES ('969', '2025-05-12', '/salary/sobcfg/salaries', '3');
INSERT INTO `oplog` VALUES ('970', '2025-05-12', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('971', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('972', '2025-05-12', '/employee/basic/exportSalary', '3');
INSERT INTO `oplog` VALUES ('973', '2025-05-12', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('974', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('975', '2025-05-12', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('976', '2025-05-12', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('977', '2025-05-12', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('978', '2025-05-12', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('979', '2025-05-12', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('980', '2025-05-12', '/system/basic/permiss/menus', '3');
INSERT INTO `oplog` VALUES ('981', '2025-05-12', '/system/basic/permiss/mids/1', '3');
INSERT INTO `oplog` VALUES ('982', '2025-05-12', '/system/basic/permiss/menus', '3');
INSERT INTO `oplog` VALUES ('983', '2025-05-12', '/system/basic/permiss/mids/4', '3');
INSERT INTO `oplog` VALUES ('984', '2025-05-12', '/system/basic/permiss/mids/13', '3');
INSERT INTO `oplog` VALUES ('985', '2025-05-12', '/system/basic/permiss/menus', '3');
INSERT INTO `oplog` VALUES ('986', '2025-05-12', '/system/basic/permiss/menus', '3');
INSERT INTO `oplog` VALUES ('987', '2025-05-12', '/system/basic/permiss/mids/6', '3');
INSERT INTO `oplog` VALUES ('988', '2025-05-12', '/system/basic/permiss/mids/4', '3');
INSERT INTO `oplog` VALUES ('989', '2025-05-12', '/system/basic/permiss/menus', '3');
INSERT INTO `oplog` VALUES ('990', '2025-05-12', '/system/basic/permiss/menus', '3');
INSERT INTO `oplog` VALUES ('991', '2025-05-12', '/system/basic/permiss/mids/3', '3');
INSERT INTO `oplog` VALUES ('992', '2025-05-12', '/system/basic/permiss/menus', '3');
INSERT INTO `oplog` VALUES ('993', '2025-05-12', '/system/basic/permiss/mids/2', '3');
INSERT INTO `oplog` VALUES ('994', '2025-05-12', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('995', '2025-05-12', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('996', '2025-05-12', '/employee/ec/', '3');
INSERT INTO `oplog` VALUES ('997', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('998', '2025-05-12', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('999', '2025-05-12', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('1000', '2025-05-12', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('1001', '2025-05-12', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('1002', '2025-05-12', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('1003', '2025-05-12', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('1004', '2025-05-12', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('1005', '2025-05-12', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('1006', '2025-05-12', '/system/config/menu', '3');
INSERT INTO `oplog` VALUES ('1007', '2025-05-12', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('1008', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('1009', '2025-05-12', '/system/basic/permiss/', '3');
INSERT INTO `oplog` VALUES ('1010', '2025-05-12', '/system/basic/joblevel/', '3');
INSERT INTO `oplog` VALUES ('1011', '2025-05-12', '/system/basic/pos/', '3');
INSERT INTO `oplog` VALUES ('1012', '2025-05-12', '/system/basic/department/', '3');
INSERT INTO `oplog` VALUES ('1013', '2025-05-12', '/system/basic/menu/getByParentId', '3');
INSERT INTO `oplog` VALUES ('1014', '2025-05-12', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('1015', '2025-05-12', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('1016', '2025-05-12', '/system/basic/menu/', '3');
INSERT INTO `oplog` VALUES ('1017', '2025-05-12', '/system/basic/oplog/', '3');
INSERT INTO `oplog` VALUES ('1018', '2025-05-12', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('1019', '2025-05-12', '/chat/hrs', '3');
INSERT INTO `oplog` VALUES ('1020', '2025-05-12', '/system/config/menu', '5');
INSERT INTO `oplog` VALUES ('1021', '2025-05-12', '/chat/hrs', '5');
INSERT INTO `oplog` VALUES ('1022', '2025-05-12', '/system/hr/', '3');
INSERT INTO `oplog` VALUES ('1023', '2025-05-12', '/chat/hrs', '3');
INSERT INTO `oplog` VALUES ('1024', '2025-05-12', '/salary/sob/', '5');
INSERT INTO `oplog` VALUES ('1025', '2025-05-12', '/salary/sobcfg/salaries', '5');
INSERT INTO `oplog` VALUES ('1026', '2025-05-12', '/salary/sobcfg/', '5');
INSERT INTO `oplog` VALUES ('1027', '2025-05-12', '/employee/ec/', '5');
INSERT INTO `oplog` VALUES ('1028', '2025-05-12', '/employee/basic/', '5');
INSERT INTO `oplog` VALUES ('1029', '2025-05-12', '/salary/sob/', '5');
INSERT INTO `oplog` VALUES ('1030', '2025-05-12', '/salary/sobcfg/salaries', '5');
INSERT INTO `oplog` VALUES ('1031', '2025-05-12', '/salary/sobcfg/', '5');
INSERT INTO `oplog` VALUES ('1032', '2025-05-12', '/system/basic/menu/', '5');
INSERT INTO `oplog` VALUES ('1033', '2025-05-12', '/system/basic/menu/getByParentId', '5');
INSERT INTO `oplog` VALUES ('1034', '2025-05-12', '/system/basic/joblevel/', '5');
INSERT INTO `oplog` VALUES ('1035', '2025-05-12', '/system/basic/pos/', '5');
INSERT INTO `oplog` VALUES ('1036', '2025-05-12', '/system/basic/permiss/', '5');
INSERT INTO `oplog` VALUES ('1037', '2025-05-12', '/system/basic/department/', '5');
INSERT INTO `oplog` VALUES ('1038', '2025-05-12', '/system/basic/menu/', '5');
INSERT INTO `oplog` VALUES ('1039', '2025-05-12', '/system/basic/menu/getByParentId', '5');
INSERT INTO `oplog` VALUES ('1040', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('1041', '2025-05-12', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('1042', '2025-05-12', '/chat/hrs', '5');
INSERT INTO `oplog` VALUES ('1043', '2025-05-12', '/chat/hrs', '3');
INSERT INTO `oplog` VALUES ('1044', '2025-05-12', '/employee/basic/positions', '3');
INSERT INTO `oplog` VALUES ('1045', '2025-05-12', '/employee/basic/', '3');
INSERT INTO `oplog` VALUES ('1046', '2025-05-12', '/chat/hrs', '3');

-- ----------------------------
-- Table structure for politicsstatus
-- ----------------------------
DROP TABLE IF EXISTS `politicsstatus`;
CREATE TABLE `politicsstatus` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(32) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=14 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of politicsstatus
-- ----------------------------
INSERT INTO `politicsstatus` VALUES ('1', '中共党员');
INSERT INTO `politicsstatus` VALUES ('2', '中共预备党员');
INSERT INTO `politicsstatus` VALUES ('3', '共青团员');
INSERT INTO `politicsstatus` VALUES ('4', '民革党员');
INSERT INTO `politicsstatus` VALUES ('5', '民盟盟员');
INSERT INTO `politicsstatus` VALUES ('6', '民建会员');
INSERT INTO `politicsstatus` VALUES ('7', '民进会员');
INSERT INTO `politicsstatus` VALUES ('8', '农工党党员');
INSERT INTO `politicsstatus` VALUES ('9', '致公党党员');
INSERT INTO `politicsstatus` VALUES ('10', '九三学社社员');
INSERT INTO `politicsstatus` VALUES ('11', '台盟盟员');
INSERT INTO `politicsstatus` VALUES ('12', '无党派民主人士');
INSERT INTO `politicsstatus` VALUES ('13', '普通公民');

-- ----------------------------
-- Table structure for position
-- ----------------------------
DROP TABLE IF EXISTS `position`;
CREATE TABLE `position` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(32) DEFAULT NULL COMMENT '职位',
  `createDate` timestamp NULL DEFAULT CURRENT_TIMESTAMP,
  `enabled` tinyint(1) DEFAULT '1',
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=37 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of position
-- ----------------------------
INSERT INTO `position` VALUES ('29', '技术总监', '2018-01-11 21:13:42', '1');
INSERT INTO `position` VALUES ('30', '运营总监', '2018-01-11 21:13:48', '1');
INSERT INTO `position` VALUES ('31', '市场总监', '2018-01-11 00:00:00', '1');
INSERT INTO `position` VALUES ('33', '研发工程师', '2018-01-14 00:00:00', '0');
INSERT INTO `position` VALUES ('34', '运维工程师', '2018-01-14 16:11:41', '1');
INSERT INTO `position` VALUES ('36', 'Java研发经理', '2019-10-01 00:00:00', '1');

-- ----------------------------
-- Table structure for role
-- ----------------------------
DROP TABLE IF EXISTS `role`;
CREATE TABLE `role` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `name` varchar(64) DEFAULT NULL,
  `nameZh` varchar(64) DEFAULT NULL COMMENT '角色名称',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=22 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of role
-- ----------------------------
INSERT INTO `role` VALUES ('1', 'ROLE_manager', '部门经理');
INSERT INTO `role` VALUES ('2', 'ROLE_personnel', '人事专员');
INSERT INTO `role` VALUES ('3', 'ROLE_recruiter', '招聘主管');
INSERT INTO `role` VALUES ('4', 'ROLE_train', '培训主管');
INSERT INTO `role` VALUES ('5', 'ROLE_performance', '薪酬绩效主管');
INSERT INTO `role` VALUES ('6', 'ROLE_admin', '系统管理员');
INSERT INTO `role` VALUES ('13', 'ROLE_test2', '测试角色2');
INSERT INTO `role` VALUES ('14', 'ROLE_test1', '测试角色1');
INSERT INTO `role` VALUES ('17', 'ROLE_test3', '测试角色3');
INSERT INTO `role` VALUES ('18', 'ROLE_test4', '测试角色4');
INSERT INTO `role` VALUES ('19', 'ROLE_test4', '测试角色4');
INSERT INTO `role` VALUES ('20', 'ROLE_test5', '测试角色5');
INSERT INTO `role` VALUES ('21', 'ROLE_test6', '测试角色6');

-- ----------------------------
-- Table structure for salary
-- ----------------------------
DROP TABLE IF EXISTS `salary`;
CREATE TABLE `salary` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `basicSalary` int(11) DEFAULT NULL COMMENT '基本工资',
  `bonus` int(11) DEFAULT NULL COMMENT '奖金',
  `lunchSalary` int(11) DEFAULT NULL COMMENT '午餐补助',
  `trafficSalary` int(11) DEFAULT NULL COMMENT '交通补助',
  `allSalary` int(11) DEFAULT NULL COMMENT '应发工资',
  `pensionBase` int(11) DEFAULT NULL COMMENT '养老金基数',
  `pensionPer` float DEFAULT NULL COMMENT '养老金比率',
  `createDate` timestamp NULL DEFAULT NULL COMMENT '启用时间',
  `medicalBase` int(11) DEFAULT NULL COMMENT '医疗基数',
  `medicalPer` float DEFAULT NULL COMMENT '医疗保险比率',
  `accumulationFundBase` int(11) DEFAULT NULL COMMENT '公积金基数',
  `accumulationFundPer` float DEFAULT NULL COMMENT '公积金比率',
  `name` varchar(32) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=17 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of salary
-- ----------------------------
INSERT INTO `salary` VALUES ('9', '9000', '4000', '800', '500', null, '2000', '0.07', '2018-01-24 00:00:00', '2000', '0.07', '2000', '0.07', '市场部工资账套');
INSERT INTO `salary` VALUES ('10', '2000', '2000', '400', '1000', null, '2000', '0.07', '2018-01-01 00:00:00', '2000', '0.07', '2000', '0.07', '人事部工资账套');
INSERT INTO `salary` VALUES ('13', '20000', '3000', '500', '500', null, '4000', '0.07', '2018-01-25 00:00:00', '4000', '0.07', '4000', '0.07', '运维部工资账套');
INSERT INTO `salary` VALUES ('16', '10000', '5000', '500', '200', null, '10000', '0.08', '2025-03-19 15:42:26', '10000', '0.08', '10000', '0.08', 'Java后端开发');

-- ----------------------------
-- Table structure for sysmsg
-- ----------------------------
DROP TABLE IF EXISTS `sysmsg`;
CREATE TABLE `sysmsg` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `mid` int(11) DEFAULT NULL COMMENT '消息id',
  `type` int(11) DEFAULT '0' COMMENT '0表示群发消息',
  `hrid` int(11) DEFAULT NULL COMMENT '这条消息是给谁的',
  `state` int(11) DEFAULT '0' COMMENT '0 未读 1 已读',
  PRIMARY KEY (`id`),
  KEY `hrid` (`hrid`),
  KEY `sysmsg_ibfk_1` (`mid`),
  CONSTRAINT `sysmsg_ibfk_1` FOREIGN KEY (`mid`) REFERENCES `msgcontent` (`id`),
  CONSTRAINT `sysmsg_ibfk_2` FOREIGN KEY (`hrid`) REFERENCES `hr` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=82 DEFAULT CHARSET=utf8;

-- ----------------------------
-- Records of sysmsg
-- ----------------------------
INSERT INTO `sysmsg` VALUES ('57', '14', '0', '3', '1');
INSERT INTO `sysmsg` VALUES ('58', '14', '0', '5', '1');
INSERT INTO `sysmsg` VALUES ('59', '14', '0', '10', '1');
INSERT INTO `sysmsg` VALUES ('60', '14', '0', '11', '0');
INSERT INTO `sysmsg` VALUES ('61', '14', '0', '12', '0');
INSERT INTO `sysmsg` VALUES ('62', '15', '0', '3', '1');
INSERT INTO `sysmsg` VALUES ('63', '15', '0', '5', '1');
INSERT INTO `sysmsg` VALUES ('64', '15', '0', '10', '1');
INSERT INTO `sysmsg` VALUES ('65', '15', '0', '11', '0');
INSERT INTO `sysmsg` VALUES ('66', '15', '0', '12', '0');
INSERT INTO `sysmsg` VALUES ('67', '16', '0', '3', '1');
INSERT INTO `sysmsg` VALUES ('68', '16', '0', '5', '1');
INSERT INTO `sysmsg` VALUES ('69', '16', '0', '10', '1');
INSERT INTO `sysmsg` VALUES ('70', '16', '0', '11', '0');
INSERT INTO `sysmsg` VALUES ('71', '16', '0', '12', '0');
INSERT INTO `sysmsg` VALUES ('72', '17', '0', '3', '1');
INSERT INTO `sysmsg` VALUES ('73', '17', '0', '5', '1');
INSERT INTO `sysmsg` VALUES ('74', '17', '0', '10', '1');
INSERT INTO `sysmsg` VALUES ('75', '17', '0', '11', '0');
INSERT INTO `sysmsg` VALUES ('76', '17', '0', '12', '0');
INSERT INTO `sysmsg` VALUES ('77', '18', '0', '3', '1');
INSERT INTO `sysmsg` VALUES ('78', '18', '0', '5', '0');
INSERT INTO `sysmsg` VALUES ('79', '18', '0', '10', '0');
INSERT INTO `sysmsg` VALUES ('80', '18', '0', '11', '0');
INSERT INTO `sysmsg` VALUES ('81', '18', '0', '12', '0');

-- ----------------------------
-- Procedure structure for addDep
-- ----------------------------
DROP PROCEDURE IF EXISTS `addDep`;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `addDep`(in depName varchar(32),in parentId int,in enabled boolean,out result int,out result2 int)
begin
  declare did int;
  declare pDepPath varchar(64);
  insert into department set name=depName,parentId=parentId,enabled=enabled;
  select row_count() into result;
  select last_insert_id() into did;
  set result2=did;
  select depPath into pDepPath from department where id=parentId;
  update department set depPath=concat(pDepPath,'.',did) where id=did;
  update department set isParent=true where id=parentId;
end
;;
DELIMITER ;

-- ----------------------------
-- Procedure structure for deleteDep
-- ----------------------------
DROP PROCEDURE IF EXISTS `deleteDep`;
DELIMITER ;;
CREATE DEFINER=`root`@`localhost` PROCEDURE `deleteDep`(in did int,out result int)
begin
  declare ecount int;
  declare pid int;
  declare pcount int;
  declare a int;
  select count(*) into a from department where id=did and isParent=false;
  if a=0 then set result=-2;
  else
  select count(*) into ecount from employee where departmentId=did;
  if ecount>0 then set result=-1;
  else
  select parentId into pid from department where id=did;
  delete from department where id=did and isParent=false;
  select row_count() into result;
  select count(*) into pcount from department where parentId=pid;
  if pcount=0 then update department set isParent=false where id=pid;
  end if;
  end if;
  end if;
end
;;
DELIMITER ;
